org/posts/sql.org
#+TITLE: SQL
#+DATE: 2026-06-29
#+TAGS: Database
#+DESCRIPTION: A comprehensive Emacs Lisp guide covering Elisp fundamentals, Emacs internals, package development, macros, debugging, performance optimization, asynchronous programming, and advanced editor extension development.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"


* SQL Q&A (Beginner to Advanced)

* Fundamentals
** Q1. What is SQL?
SQL (Structured Query Language) is the standard language for managing and
querying data in relational database management systems (RDBMS). It is
declarative — you describe /what/ you want, not /how/ to fetch it.

** Q2. What are the main categories of SQL statements?
- *DDL* (Data Definition Language): =CREATE=, =ALTER=, =DROP=, =TRUNCATE=
- *DML* (Data Manipulation Language): =SELECT=, =INSERT=, =UPDATE=, =DELETE=
- *DCL* (Data Control Language): =GRANT=, =REVOKE=
- *TCL* (Transaction Control Language): =COMMIT=, =ROLLBACK=, =SAVEPOINT=

** Q3. What is a relational database?
A database that organizes data into tables (relations) made of rows and columns, where relationships between tables are expressed via keys.

** Q4. What is a table, row, and column?
A *table* is a collection of related data. A *row* (tuple/record) is a single entry.
A *column* (attribute/field) defines a data type and meaning for a value in each row.

** Q5. Write a basic SELECT statement.
#+begin_src sql
SELECT first_name, last_name FROM employees;
#+end_src

** Q6. How do you select all columns from a table?

#+begin_src sql
SELECT * FROM employees;
#+end_src

Avoid =SELECT *= in production code — it hurts performance and breaks when the schema changes.

** Q7. What is the difference between WHERE and HAVING?
=WHERE= filters rows /before/ grouping/aggregation. =HAVING= filters /after/ =GROUP BY=, allowing conditions on aggregate functions.

** Q8. What is the logical order of execution of a SELECT query?
=FROM= → =JOIN= → =WHERE= → =GROUP BY= → =HAVING= → =SELECT= → =DISTINCT= → =ORDER BY= → =LIMIT/OFFSET=. (Written order differs from execution order.)

** Q9. What is NULL in SQL?
=NULL= represents a missing or unknown value. It is not equal to 0 or an empty string, and any comparison with =NULL= using ~=~ yields =UNKNOWN=.

** Q10. How do you test for NULL?
#+begin_src sql
SELECT * FROM employees WHERE manager_id IS NULL;
SELECT * FROM employees WHERE manager_id IS NOT NULL;
#+end_src

** Q11. What is the difference between DELETE, TRUNCATE, and DROP?
- =DELETE= removes rows (DML, can have =WHERE=, logged, can rollback).
- =TRUNCATE= removes all rows fast (DDL, resets identity, usually can't filter, minimal logging).
- =DROP= removes the entire table/object structure.

** Q12. What is the difference between CHAR and VARCHAR?
=CHAR(n)= is fixed length, padded with spaces. =VARCHAR(n)= is variable length, storing only the actual characters plus length info.

** Q13. How do you insert a row?
#+begin_src sql
INSERT INTO employees (first_name, last_name, salary)
VALUES ('Ada', 'Lovelace', 90000);
#+end_src

** Q14. How do you insert multiple rows at once?
#+begin_src sql
INSERT INTO employees (first_name, salary) VALUES
  ('Ada', 90000),
  ('Alan', 85000),
  ('Grace', 95000);
#+end_src

** Q15. How do you update existing data?
#+begin_src sql
UPDATE employees SET salary = salary * 1.10 WHERE department_id = 3;
#+end_src

Always include a =WHERE= clause unless you intend to update every row.

** Q16. How do you delete rows?
#+begin_src sql
DELETE FROM employees WHERE termination_date IS NOT NULL;
#+end_src

** Q17. What is a primary key?
A column or set of columns that uniquely identifies each row.
It cannot contain =NULL= and must be unique.
A table has at most one primary key.

** Q18. What is a foreign key?
A column (or columns) that references the primary key of another table, enforcing referential integrity between the two tables.

** Q19. What is a composite key?
A primary or unique key made up of more than one column.

** Q20. What is a candidate key vs. a surrogate key?
A *candidate key* is any column set that could uniquely identify a row (natural key).
A *surrogate key* is an artificial identifier (e.g., auto-increment id) with no business meaning.

** Q21. What is the difference between DISTINCT and GROUP BY?
=DISTINCT= removes duplicate rows from the result set. =GROUP BY= groups rows to apply aggregate functions.
=GROUP BY= without aggregates behaves similarly to =DISTINCT= but is more flexible.

