public/posts/sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SQL</title>
<meta name="description" content="A comprehensive Emacs Lisp guide covering Elisp fundamentals, Emacs internals, package development, macros, debugging, performance optimization, asynchronous programming, and advanced editor extension development." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">SQL</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org219b04f" class="outline-2">
<h2 id="org219b04f">SQL Q&amp;A (Beginner to Advanced)</h2>
</div>

<div id="outline-container-orgb2e0cd1" class="outline-2">
<h2 id="orgb2e0cd1">Fundamentals</h2>
<div class="outline-text-2" id="text-orgb2e0cd1">
</div>
<div id="outline-container-orga51796e" class="outline-3">
<h3 id="orga51796e">Q1. What is SQL?</h3>
<div class="outline-text-3" id="text-orga51796e">
<p>
SQL (Structured Query Language) is the standard language for managing and
querying data in relational database management systems (RDBMS). It is
declarative — you describe <i>what</i> you want, not <i>how</i> to fetch it.
</p>
</div>
</div>
<div id="outline-container-orgbf972aa" class="outline-3">
<h3 id="orgbf972aa">Q2. What are the main categories of SQL statements?</h3>
<div class="outline-text-3" id="text-orgbf972aa">
<ul class="org-ul">
<li><b>DDL</b> (Data Definition Language): <code>CREATE</code>, <code>ALTER</code>, <code>DROP</code>, <code>TRUNCATE</code></li>
<li><b>DML</b> (Data Manipulation Language): <code>SELECT</code>, <code>INSERT</code>, <code>UPDATE</code>, <code>DELETE</code></li>
<li><b>DCL</b> (Data Control Language): <code>GRANT</code>, <code>REVOKE</code></li>
<li><b>TCL</b> (Transaction Control Language): <code>COMMIT</code>, <code>ROLLBACK</code>, <code>SAVEPOINT</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgd30b5f2" class="outline-3">
<h3 id="orgd30b5f2">Q3. What is a relational database?</h3>
<div class="outline-text-3" id="text-orgd30b5f2">
<p>
A database that organizes data into tables (relations) made of rows and columns, where relationships between tables are expressed via keys.
</p>
</div>
</div>
<div id="outline-container-orgc068dfa" class="outline-3">
<h3 id="orgc068dfa">Q4. What is a table, row, and column?</h3>
<div class="outline-text-3" id="text-orgc068dfa">
<p>
A <b>table</b> is a collection of related data. A <b>row</b> (tuple/record) is a single entry.
A <b>column</b> (attribute/field) defines a data type and meaning for a value in each row.
</p>
</div>
</div>
<div id="outline-container-org1a08ad7" class="outline-3">
<h3 id="org1a08ad7">Q5. Write a basic SELECT statement.</h3>
<div class="outline-text-3" id="text-org1a08ad7">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> first_name, last_name <span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org29df0de" class="outline-3">
<h3 id="org29df0de">Q6. How do you select all columns from a table?</h3>
<div class="outline-text-3" id="text-org29df0de">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>

<p>
Avoid <code>SELECT *</code> in production code — it hurts performance and breaks when the schema changes.
</p>
</div>
</div>
<div id="outline-container-org29b01fd" class="outline-3">
<h3 id="org29b01fd">Q7. What is the difference between WHERE and HAVING?</h3>
<div class="outline-text-3" id="text-org29b01fd">
<p>
<code>WHERE</code> filters rows <i>before</i> grouping/aggregation. <code>HAVING</code> filters <i>after</i> <code>GROUP BY</code>, allowing conditions on aggregate functions.
</p>
</div>
</div>
<div id="outline-container-org0e7ace5" class="outline-3">
<h3 id="org0e7ace5">Q8. What is the logical order of execution of a SELECT query?</h3>
<div class="outline-text-3" id="text-org0e7ace5">
<p>
<code>FROM</code> → <code>JOIN</code> → <code>WHERE</code> → <code>GROUP BY</code> → <code>HAVING</code> → <code>SELECT</code> → <code>DISTINCT</code> → <code>ORDER BY</code> → <code>LIMIT/OFFSET</code>. (Written order differs from execution order.)
</p>
</div>
</div>
<div id="outline-container-orgbec8ac8" class="outline-3">
<h3 id="orgbec8ac8">Q9. What is NULL in SQL?</h3>
<div class="outline-text-3" id="text-orgbec8ac8">
<p>
<code>NULL</code> represents a missing or unknown value. It is not equal to 0 or an empty string, and any comparison with <code>NULL</code> using <code>=</code> yields <code>UNKNOWN</code>.
</p>
</div>
</div>
<div id="outline-container-org26ab487" class="outline-3">
<h3 id="org26ab487">Q10. How do you test for NULL?</h3>
<div class="outline-text-3" id="text-org26ab487">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> manager_id <span style="font-weight: bold;">IS</span> <span style="font-weight: bold;">NULL</span>;
<span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> manager_id <span style="font-weight: bold;">IS</span> <span style="font-weight: bold;">NOT</span> <span style="font-weight: bold;">NULL</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org04fb646" class="outline-3">
<h3 id="org04fb646">Q11. What is the difference between DELETE, TRUNCATE, and DROP?</h3>
<div class="outline-text-3" id="text-org04fb646">
<ul class="org-ul">
<li><code>DELETE</code> removes rows (DML, can have <code>WHERE</code>, logged, can rollback).</li>
<li><code>TRUNCATE</code> removes all rows fast (DDL, resets identity, usually can't filter, minimal logging).</li>
<li><code>DROP</code> removes the entire table/object structure.</li>
</ul>
</div>
</div>
<div id="outline-container-org5ac192a" class="outline-3">
<h3 id="org5ac192a">Q12. What is the difference between CHAR and VARCHAR?</h3>
<div class="outline-text-3" id="text-org5ac192a">
<p>
<code>CHAR(n)</code> is fixed length, padded with spaces. <code>VARCHAR(n)</code> is variable length, storing only the actual characters plus length info.
</p>
</div>
</div>
<div id="outline-container-org07a3d05" class="outline-3">
<h3 id="org07a3d05">Q13. How do you insert a row?</h3>
<div class="outline-text-3" id="text-org07a3d05">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> employees (first_name, last_name, salary)
<span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'Ada'</span>, <span style="font-style: italic;">'Lovelace'</span>, 90000);
</pre>
</div>
</div>
</div>
<div id="outline-container-org61eeae9" class="outline-3">
<h3 id="org61eeae9">Q14. How do you insert multiple rows at once?</h3>
<div class="outline-text-3" id="text-org61eeae9">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> employees (first_name, salary) <span style="font-weight: bold;">VALUES</span>
  (<span style="font-style: italic;">'Ada'</span>, 90000),
  (<span style="font-style: italic;">'Alan'</span>, 85000),
  (<span style="font-style: italic;">'Grace'</span>, 95000);
</pre>
</div>
</div>
</div>
<div id="outline-container-org60955ed" class="outline-3">
<h3 id="org60955ed">Q15. How do you update existing data?</h3>
<div class="outline-text-3" id="text-org60955ed">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">UPDATE</span> employees <span style="font-weight: bold;">SET</span> salary = salary * 1.10 <span style="font-weight: bold;">WHERE</span> department_id = 3;
</pre>
</div>

<p>
Always include a <code>WHERE</code> clause unless you intend to update every row.
</p>
</div>
</div>
<div id="outline-container-orgf6450e9" class="outline-3">
<h3 id="orgf6450e9">Q16. How do you delete rows?</h3>
<div class="outline-text-3" id="text-orgf6450e9">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> termination_date <span style="font-weight: bold;">IS</span> <span style="font-weight: bold;">NOT</span> <span style="font-weight: bold;">NULL</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ebd93f" class="outline-3">
<h3 id="org6ebd93f">Q17. What is a primary key?</h3>
<div class="outline-text-3" id="text-org6ebd93f">
<p>
A column or set of columns that uniquely identifies each row.
It cannot contain <code>NULL</code> and must be unique.
A table has at most one primary key.
</p>
</div>
</div>
<div id="outline-container-orgcbb0be9" class="outline-3">
<h3 id="orgcbb0be9">Q18. What is a foreign key?</h3>
<div class="outline-text-3" id="text-orgcbb0be9">
<p>
A column (or columns) that references the primary key of another table, enforcing referential integrity between the two tables.
</p>
</div>
</div>
<div id="outline-container-org55b5a29" class="outline-3">
<h3 id="org55b5a29">Q19. What is a composite key?</h3>
<div class="outline-text-3" id="text-org55b5a29">
<p>
A primary or unique key made up of more than one column.
</p>
</div>
</div>
<div id="outline-container-orge440387" class="outline-3">
<h3 id="orge440387">Q20. What is a candidate key vs. a surrogate key?</h3>
<div class="outline-text-3" id="text-orge440387">
<p>
A <b>candidate key</b> is any column set that could uniquely identify a row (natural key).
A <b>surrogate key</b> is an artificial identifier (e.g., auto-increment id) with no business meaning.
</p>
</div>
</div>
<div id="outline-container-org7cb603f" class="outline-3">
<h3 id="org7cb603f">Q21. What is the difference between DISTINCT and GROUP BY?</h3>
<div class="outline-text-3" id="text-org7cb603f">
<p>
<code>DISTINCT</code> removes duplicate rows from the result set. <code>GROUP BY</code> groups rows to apply aggregate functions.
<code>GROUP BY</code> without aggregates behaves similarly to <code>DISTINCT</code> but is more flexible.
</p>
</div>
</div>
