org/posts/sql.org
** Q22. How do you rename a column in the output?
#+begin_src sql
SELECT salary AS monthly_salary, salary * 12 AS annual_salary FROM employees;
#+end_src

** Q23. How do you concatenate strings?
- ANSI/PostgreSQL/Oracle: ~first_name || ' ' || last_name~
- SQL Server: ~first_name + ' ' + last_name~ or =CONCAT(...)=
- MySQL: =CONCAT(first_name, ' ', last_name)=


** Q24. What is the difference between = and LIKE?
~=~ matches exact values. =LIKE= matches patterns using wildcards =%= (any sequence) and =_= (single character).

** Q25. How do you filter with a pattern?
#+begin_src sql
SELECT * FROM employees WHERE last_name LIKE 'S%';   -- starts with S
SELECT * FROM employees WHERE email LIKE '%@gmail.com';
#+end_src

** Q26. What is the IN operator?
A shorthand for multiple OR conditions:

#+begin_src sql
SELECT * FROM employees WHERE department_id IN (1, 2, 5);
#+end_src

** Q27. What is the BETWEEN operator?
Inclusive range filter:

#+begin_src sql
SELECT * FROM employees WHERE salary BETWEEN 50000 AND 80000;
#+end_src

** Q28. How do you sort results?
#+begin_src sql
SELECT * FROM employees ORDER BY salary DESC, last_name ASC;
#+end_src

** Q29. How do you limit the number of rows returned?
- PostgreSQL/MySQL: =LIMIT 10=
- SQL Server: =SELECT TOP 10 ...= or =OFFSET 0 ROWS FETCH NEXT 10 ROWS ONLY=
- Oracle 12c+: =FETCH FIRST 10 ROWS ONLY=

** Q30. What is a comment in SQL?

#+begin_src sql

-- single line comment

/* multi
   line comment */
   
#+end_src

* Filtering, Sorting & Functions
** Q31. What are the common comparison operators?
~=~, ~<>~ (or ~!=~), ~<~, ~>~, ~<=~, ~>=~.

** Q32. What is the difference between AND and OR precedence?
=AND= binds tighter than =OR=. Use parentheses to make intent explicit:
#+begin_src sql
WHERE department_id = 1 AND (salary > 50000 OR bonus > 5000)
#+end_src

** Q33. How do you handle NULLs in calculations?
Use =COALESCE= to substitute a default:

#+begin_src sql
SELECT COALESCE(bonus, 0) + salary AS total_comp FROM employees;
#+end_src

** Q34. What is the difference between COALESCE and ISNULL/NVL?
=COALESCE= is ANSI standard and accepts many arguments, returning the first
non-null. =ISNULL= (SQL Server) and =NVL= (Oracle) take exactly two arguments.

** Q35. What does NULLIF do?
Returns =NULL= if the two arguments are equal; otherwise returns the first.
Useful to avoid divide-by-zero:

#+begin_src sql
SELECT total / NULLIF(count, 0) FROM stats;
#+end_src

** Q36. What is a CASE expression?
Conditional logic in queries:

#+begin_src sql
SELECT name,
  CASE WHEN salary > 100000 THEN 'High'
       WHEN salary > 50000  THEN 'Mid'
       ELSE 'Low' END AS band
FROM employees;
#+end_src

** Q37. What's the difference between simple and searched CASE?
Simple =CASE expr WHEN value THEN ...= compares one expression to values.
Searched =CASE WHEN condition THEN ...= evaluates arbitrary boolean conditions.

** Q38. Common string functions?
=UPPER=, =LOWER=, =LENGTH=/=LEN=, =SUBSTRING=, =TRIM=, =LTRIM=, =RTRIM=, =REPLACE=, =LEFT=, =RIGHT=, =POSITION=/=CHARINDEX=.

** Q39. How do you extract part of a string?
#+begin_src sql
SELECT SUBSTRING(phone FROM 1 FOR 3) FROM contacts;  -- ANSI
SELECT SUBSTRING(phone, 1, 3) FROM contacts;          -- common dialect form
#+end_src

** Q40. Common numeric functions?
=ABS=, =ROUND=, =CEIL=/=CEILING=, =FLOOR=, =MOD=, =POWER=, =SQRT=, =TRUNC=.

** Q41. How do you round to two decimals?
#+begin_src sql
SELECT ROUND(price, 2) FROM products;
#+end_src

** Q42. How do you get the current date/time?
- PostgreSQL: =CURRENT_DATE=, =CURRENT_TIMESTAMP=, =NOW()=
- MySQL: =CURDATE()=, =NOW()=
- SQL Server: =GETDATE()=, =SYSDATETIME()=
- Oracle: =SYSDATE=, =CURRENT_TIMESTAMP=

** Q43. How do you compute the difference between two dates?
- PostgreSQL: ~end_date - start_date~ (returns days/interval)
- MySQL: =DATEDIFF(end_date, start_date)=
- SQL Server: =DATEDIFF(DAY, start_date, end_date)=

