public/posts/sql.html
<div id="outline-container-org4193084" class="outline-3">
<h3 id="org4193084">Q22. How do you rename a column in the output?</h3>
<div class="outline-text-3" id="text-org4193084">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> salary <span style="font-weight: bold;">AS</span> monthly_salary, salary * 12 <span style="font-weight: bold;">AS</span> annual_salary <span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org23f21b0" class="outline-3">
<h3 id="org23f21b0">Q23. How do you concatenate strings?</h3>
<div class="outline-text-3" id="text-org23f21b0">
<ul class="org-ul">
<li>ANSI/PostgreSQL/Oracle: <code>first_name || ' ' || last_name</code></li>
<li>SQL Server: <code>first_name + ' ' + last_name</code> or <code>CONCAT(...)</code></li>
<li>MySQL: <code>CONCAT(first_name, ' ', last_name)</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgbdcc9bf" class="outline-3">
<h3 id="orgbdcc9bf">Q24. What is the difference between = and LIKE?</h3>
<div class="outline-text-3" id="text-orgbdcc9bf">
<p>
<code>=</code> matches exact values. <code>LIKE</code> matches patterns using wildcards <code>%</code> (any sequence) and <code>_</code> (single character).
</p>
</div>
</div>
<div id="outline-container-orgea98d78" class="outline-3">
<h3 id="orgea98d78">Q25. How do you filter with a pattern?</h3>
<div class="outline-text-3" id="text-orgea98d78">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> last_name <span style="font-weight: bold;">LIKE</span> <span style="font-style: italic;">'S%'</span>;   <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">starts with S
</span><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> email <span style="font-weight: bold;">LIKE</span> <span style="font-style: italic;">'%@gmail.com'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f9bda8" class="outline-3">
<h3 id="org0f9bda8">Q26. What is the IN operator?</h3>
<div class="outline-text-3" id="text-org0f9bda8">
<p>
A shorthand for multiple OR conditions:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> department_id <span style="font-weight: bold;">IN</span> (1, 2, 5);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf29a135" class="outline-3">
<h3 id="orgf29a135">Q27. What is the BETWEEN operator?</h3>
<div class="outline-text-3" id="text-orgf29a135">
<p>
Inclusive range filter:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> salary <span style="font-weight: bold;">BETWEEN</span> 50000 <span style="font-weight: bold;">AND</span> 80000;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf72343d" class="outline-3">
<h3 id="orgf72343d">Q28. How do you sort results?</h3>
<div class="outline-text-3" id="text-orgf72343d">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary <span style="font-weight: bold;">DESC</span>, last_name <span style="font-weight: bold;">ASC</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a076dd" class="outline-3">
<h3 id="org7a076dd">Q29. How do you limit the number of rows returned?</h3>
<div class="outline-text-3" id="text-org7a076dd">
<ul class="org-ul">
<li>PostgreSQL/MySQL: <code>LIMIT 10</code></li>
<li>SQL Server: <code>SELECT TOP 10 ...</code> or <code>OFFSET 0 ROWS FETCH NEXT 10 ROWS ONLY</code></li>
<li>Oracle 12c+: <code>FETCH FIRST 10 ROWS ONLY</code></li>
</ul>
</div>
</div>
<div id="outline-container-org7e3d9eb" class="outline-3">
<h3 id="org7e3d9eb">Q30. What is a comment in SQL?</h3>
<div class="outline-text-3" id="text-org7e3d9eb">
<div class="org-src-container">
<pre class="src src-sql">
<span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">single line comment
</span>
<span style="font-weight: bold; font-style: italic;">/* multi
   line comment */</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc0b7a5a" class="outline-2">
<h2 id="orgc0b7a5a">Filtering, Sorting &amp; Functions</h2>
<div class="outline-text-2" id="text-orgc0b7a5a">
</div>
<div id="outline-container-org888c40f" class="outline-3">
<h3 id="org888c40f">Q31. What are the common comparison operators?</h3>
<div class="outline-text-3" id="text-org888c40f">
<p>
<code>=</code>, <code>&lt;&gt;</code> (or <code>!=</code>), <code>&lt;</code>, <code>&gt;</code>, <code>&lt;=</code>, <code>&gt;=</code>.
</p>
</div>
</div>
<div id="outline-container-org17ba74b" class="outline-3">
<h3 id="org17ba74b">Q32. What is the difference between AND and OR precedence?</h3>
<div class="outline-text-3" id="text-org17ba74b">
<p>
<code>AND</code> binds tighter than <code>OR</code>. Use parentheses to make intent explicit:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">WHERE</span> department_id = 1 <span style="font-weight: bold;">AND</span> (salary &gt; 50000 <span style="font-weight: bold;">OR</span> bonus &gt; 5000)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0d4091" class="outline-3">
<h3 id="orgc0d4091">Q33. How do you handle NULLs in calculations?</h3>
<div class="outline-text-3" id="text-orgc0d4091">
<p>
Use <code>COALESCE</code> to substitute a default:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">COALESCE</span>(bonus, 0) + salary <span style="font-weight: bold;">AS</span> total_comp <span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org57b9131" class="outline-3">
<h3 id="org57b9131">Q34. What is the difference between COALESCE and ISNULL/NVL?</h3>
<div class="outline-text-3" id="text-org57b9131">
<p>
<code>COALESCE</code> is ANSI standard and accepts many arguments, returning the first
non-null. <code>ISNULL</code> (SQL Server) and <code>NVL</code> (Oracle) take exactly two arguments.
</p>
</div>
</div>
<div id="outline-container-orgf83cabb" class="outline-3">
<h3 id="orgf83cabb">Q35. What does NULLIF do?</h3>
<div class="outline-text-3" id="text-orgf83cabb">
<p>
Returns <code>NULL</code> if the two arguments are equal; otherwise returns the first.
Useful to avoid divide-by-zero:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> total / <span style="font-weight: bold;">NULLIF</span>(<span style="font-weight: bold;">count</span>, 0) <span style="font-weight: bold;">FROM</span> stats;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5c7786" class="outline-3">
<h3 id="orgf5c7786">Q36. What is a CASE expression?</h3>
<div class="outline-text-3" id="text-orgf5c7786">
<p>
Conditional logic in queries:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>,
  <span style="font-weight: bold;">CASE</span> <span style="font-weight: bold;">WHEN</span> salary &gt; 100000 <span style="font-weight: bold;">THEN</span> <span style="font-style: italic;">'High'</span>
       <span style="font-weight: bold;">WHEN</span> salary &gt; 50000  <span style="font-weight: bold;">THEN</span> <span style="font-style: italic;">'Mid'</span>
       <span style="font-weight: bold;">ELSE</span> <span style="font-style: italic;">'Low'</span> <span style="font-weight: bold;">END</span> <span style="font-weight: bold;">AS</span> band
<span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e2091a" class="outline-3">
<h3 id="org6e2091a">Q37. What's the difference between simple and searched CASE?</h3>
<div class="outline-text-3" id="text-org6e2091a">
<p>
Simple <code>CASE expr WHEN value THEN ...</code> compares one expression to values.
Searched <code>CASE WHEN condition THEN ...</code> evaluates arbitrary boolean conditions.
</p>
</div>
</div>
<div id="outline-container-orgb8db25f" class="outline-3">
<h3 id="orgb8db25f">Q38. Common string functions?</h3>
<div class="outline-text-3" id="text-orgb8db25f">
<p>
<code>UPPER</code>, <code>LOWER</code>, <code>LENGTH=/=LEN</code>, <code>SUBSTRING</code>, <code>TRIM</code>, <code>LTRIM</code>, <code>RTRIM</code>, <code>REPLACE</code>, <code>LEFT</code>, <code>RIGHT</code>, <code>POSITION=/=CHARINDEX</code>.
</p>
</div>
</div>
<div id="outline-container-orgdc62846" class="outline-3">
<h3 id="orgdc62846">Q39. How do you extract part of a string?</h3>
<div class="outline-text-3" id="text-orgdc62846">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">SUBSTRING</span>(phone <span style="font-weight: bold;">FROM</span> 1 <span style="font-weight: bold;">FOR</span> 3) <span style="font-weight: bold;">FROM</span> contacts;  <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">ANSI
</span><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">SUBSTRING</span>(phone, 1, 3) <span style="font-weight: bold;">FROM</span> contacts;          <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">common dialect form</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4daac68" class="outline-3">
<h3 id="org4daac68">Q40. Common numeric functions?</h3>
<div class="outline-text-3" id="text-org4daac68">
<p>
<code>ABS</code>, <code>ROUND</code>, <code>CEIL=/=CEILING</code>, <code>FLOOR</code>, <code>MOD</code>, <code>POWER</code>, <code>SQRT</code>, <code>TRUNC</code>.
</p>
</div>
</div>
<div id="outline-container-orga897989" class="outline-3">
<h3 id="orga897989">Q41. How do you round to two decimals?</h3>
<div class="outline-text-3" id="text-orga897989">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> ROUND(price, 2) <span style="font-weight: bold;">FROM</span> products;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf235974" class="outline-3">
<h3 id="orgf235974">Q42. How do you get the current date/time?</h3>
<div class="outline-text-3" id="text-orgf235974">
<ul class="org-ul">
<li>PostgreSQL: <code>CURRENT_DATE</code>, <code>CURRENT_TIMESTAMP</code>, <code>NOW()</code></li>
<li>MySQL: <code>CURDATE()</code>, <code>NOW()</code></li>
<li>SQL Server: <code>GETDATE()</code>, <code>SYSDATETIME()</code></li>
<li>Oracle: <code>SYSDATE</code>, <code>CURRENT_TIMESTAMP</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgd1ac43f" class="outline-3">
<h3 id="orgd1ac43f">Q43. How do you compute the difference between two dates?</h3>
<div class="outline-text-3" id="text-orgd1ac43f">
<ul class="org-ul">
<li>PostgreSQL: <code>end_date - start_date</code> (returns days/interval)</li>
<li>MySQL: <code>DATEDIFF(end_date, start_date)</code></li>
<li>SQL Server: <code>DATEDIFF(DAY, start_date, end_date)</code></li>
</ul>
</div>
</div>
