org/posts/sql.org
** Q44. How do you extract the year from a date?
#+begin_src sql
SELECT EXTRACT(YEAR FROM hire_date) FROM employees;  -- ANSI/PostgreSQL
SELECT YEAR(hire_date) FROM employees;                -- MySQL/SQL Server
#+end_src

** Q45. How do you add days/months to a date?
- PostgreSQL: ~hire_date + INTERVAL '30 days'~
- MySQL: =DATE_ADD(hire_date, INTERVAL 30 DAY)=
- SQL Server: =DATEADD(DAY, 30, hire_date)=
- Oracle: ~hire_date + 30~ or =ADD_MONTHS(hire_date, 1)=

** Q46. How do you cast/convert data types?
#+begin_src sql
SELECT CAST(salary AS VARCHAR(20)) FROM employees;       -- ANSI
SELECT CAST('2024-01-01' AS DATE);
SELECT salary::TEXT FROM employees;                       -- PostgreSQL shorthand
#+end_src

** Q47. What is the difference between ORDER BY column and ORDER BY position?
You can order by output column position number (=ORDER BY 2=), but it's fragile — prefer column names or aliases for readability.

** Q48. How do NULLs sort?
By default, PostgreSQL/Oracle sort NULLs last in =ASC= (configurable with =NULLS FIRST/LAST=);
MySQL/SQL Server sort NULLs first in =ASC=. Use explicit =NULLS FIRST=/=NULLS LAST= where supported.

** Q49. How do you implement pagination?
#+begin_src sql
SELECT * FROM products ORDER BY id LIMIT 20 OFFSET 40;  -- page 3, 20 per page
#+end_src

For large offsets, prefer keyset pagination (~WHERE id > :last_id~).

** Q50. What is the EXISTS operator?
Returns true if a subquery returns any rows. Often faster than =IN= for correlated checks:

#+begin_src sql
SELECT * FROM customers c
WHERE EXISTS (SELECT 1 FROM orders o WHERE o.customer_id = c.id);
#+end_src

** Q51. How do you filter case-insensitively?
#+begin_src sql
SELECT * FROM employees WHERE LOWER(last_name) = 'smith';
SELECT * FROM employees WHERE last_name ILIKE 'smith';  -- PostgreSQL
#+end_src

** Q52. What does the ANY/SOME and ALL keyword do?
Compare a value against a set:

#+begin_src sql
SELECT * FROM products WHERE price > ALL (SELECT price FROM clearance);
SELECT * FROM products WHERE price > ANY (SELECT price FROM clearance);
#+end_src

** Q53. How do you escape a wildcard in LIKE?
#+begin_src sql
SELECT * FROM files WHERE name LIKE '100\%' ESCAPE '\';
#+end_src

** Q54. What is the difference between COUNT(*), COUNT(column), and COUNT(DISTINCT column)?
=COUNT(*)= counts all rows.
=COUNT(column)= counts non-null values.
=COUNT(DISTINCT column)= counts unique non-null values.

** Q55. How do you concatenate multiple rows into one string?
- PostgreSQL: =STRING_AGG(name, ', ')=
- MySQL: =GROUP_CONCAT(name SEPARATOR ', ')=
- SQL Server: =STRING_AGG(name, ', ')=
- Oracle: =LISTAGG(name, ', ') WITHIN GROUP (ORDER BY name)=

* Joins
** Q56. What is a JOIN?
A JOIN combines rows from two or more tables based on a related column.

** Q57. What is an INNER JOIN?
Returns only rows where the join condition matches in both tables:

#+begin_src sql
SELECT e.name, d.name
FROM employees e
INNER JOIN departments d ON e.department_id = d.id;
#+end_src

** Q58. What is a LEFT (OUTER) JOIN?
Returns all rows from the left table and matching rows from the right; unmatched right-side columns are =NULL=.

** Q59. What is a RIGHT JOIN?
The mirror of LEFT JOIN — all rows from the right table, matched or not.

** Q60. What is a FULL OUTER JOIN?
Returns all rows from both tables, with =NULL= where there's no match on either
side. (MySQL lacks it natively; emulate with =LEFT JOIN UNION RIGHT JOIN=.)

** Q61. What is a CROSS JOIN?
Produces the Cartesian product — every row of A combined with every row of B.

** Q62. What is a self join?
A table joined to itself, typically to compare rows or model hierarchies:

#+begin_src sql
SELECT e.name AS employee, m.name AS manager
FROM employees e
LEFT JOIN employees m ON e.manager_id = m.id;
#+end_src

** Q63. What is the difference between an equi-join and a non-equi join?
An equi-join uses ~=~ in the condition. A non-equi join uses other operators
(~<~, ~>~, =BETWEEN=), e.g., joining to a salary-band range table.

