public/posts/sql.html
<div id="outline-container-org3c41796" class="outline-3">
<h3 id="org3c41796">Q44. How do you extract the year from a date?</h3>
<div class="outline-text-3" id="text-org3c41796">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">EXTRACT</span>(<span style="font-weight: bold;">YEAR</span> <span style="font-weight: bold;">FROM</span> hire_date) <span style="font-weight: bold;">FROM</span> employees;  <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">ANSI/PostgreSQL
</span><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">YEAR</span>(hire_date) <span style="font-weight: bold;">FROM</span> employees;                <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">MySQL/SQL Server</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgddd2168" class="outline-3">
<h3 id="orgddd2168">Q45. How do you add days/months to a date?</h3>
<div class="outline-text-3" id="text-orgddd2168">
<ul class="org-ul">
<li>PostgreSQL: <code>hire_date + INTERVAL '30 days'</code></li>
<li>MySQL: <code>DATE_ADD(hire_date, INTERVAL 30 DAY)</code></li>
<li>SQL Server: <code>DATEADD(DAY, 30, hire_date)</code></li>
<li>Oracle: <code>hire_date + 30</code> or <code>ADD_MONTHS(hire_date, 1)</code></li>
</ul>
</div>
</div>
<div id="outline-container-org720728a" class="outline-3">
<h3 id="org720728a">Q46. How do you cast/convert data types?</h3>
<div class="outline-text-3" id="text-org720728a">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">CAST</span>(salary <span style="font-weight: bold;">AS</span> <span style="font-weight: bold; text-decoration: underline;">VARCHAR</span>(20)) <span style="font-weight: bold;">FROM</span> employees;       <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">ANSI
</span><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">CAST</span>(<span style="font-style: italic;">'2024-01-01'</span> <span style="font-weight: bold;">AS</span> <span style="font-weight: bold; text-decoration: underline;">DATE</span>);
<span style="font-weight: bold;">SELECT</span> salary::TEXT <span style="font-weight: bold;">FROM</span> employees;                       <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">PostgreSQL shorthand</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a2a05b" class="outline-3">
<h3 id="org5a2a05b">Q47. What is the difference between ORDER BY column and ORDER BY position?</h3>
<div class="outline-text-3" id="text-org5a2a05b">
<p>
You can order by output column position number (<code>ORDER BY 2</code>), but it's fragile — prefer column names or aliases for readability.
</p>
</div>
</div>
<div id="outline-container-org7eea0f2" class="outline-3">
<h3 id="org7eea0f2">Q48. How do NULLs sort?</h3>
<div class="outline-text-3" id="text-org7eea0f2">
<p>
By default, PostgreSQL/Oracle sort NULLs last in <code>ASC</code> (configurable with <code>NULLS FIRST/LAST</code>);
MySQL/SQL Server sort NULLs first in <code>ASC</code>. Use explicit <code>NULLS FIRST=/=NULLS LAST</code> where supported.
</p>
</div>
</div>
<div id="outline-container-orgd38b905" class="outline-3">
<h3 id="orgd38b905">Q49. How do you implement pagination?</h3>
<div class="outline-text-3" id="text-orgd38b905">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> products <span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> id <span style="font-weight: bold;">LIMIT</span> 20 OFFSET 40;  <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">page 3, 20 per page</span>
</pre>
</div>

<p>
For large offsets, prefer keyset pagination (<code>WHERE id &gt; :last_id</code>).
</p>
</div>
</div>
<div id="outline-container-orgbc00b03" class="outline-3">
<h3 id="orgbc00b03">Q50. What is the EXISTS operator?</h3>
<div class="outline-text-3" id="text-orgbc00b03">
<p>
Returns true if a subquery returns any rows. Often faster than <code>IN</code> for correlated checks:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> customers c
<span style="font-weight: bold;">WHERE</span> <span style="font-weight: bold;">EXISTS</span> (<span style="font-weight: bold;">SELECT</span> 1 <span style="font-weight: bold;">FROM</span> orders o <span style="font-weight: bold;">WHERE</span> o.customer_id = c.id);
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ce5ac4" class="outline-3">
<h3 id="org0ce5ac4">Q51. How do you filter case-insensitively?</h3>
<div class="outline-text-3" id="text-org0ce5ac4">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> <span style="font-weight: bold;">LOWER</span>(last_name) = <span style="font-style: italic;">'smith'</span>;
<span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> last_name ILIKE <span style="font-style: italic;">'smith'</span>;  <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">PostgreSQL</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3e1f81" class="outline-3">
<h3 id="orgf3e1f81">Q52. What does the ANY/SOME and ALL keyword do?</h3>
<div class="outline-text-3" id="text-orgf3e1f81">
<p>
Compare a value against a set:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> products <span style="font-weight: bold;">WHERE</span> price &gt; <span style="font-weight: bold;">ALL</span> (<span style="font-weight: bold;">SELECT</span> price <span style="font-weight: bold;">FROM</span> clearance);
<span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> products <span style="font-weight: bold;">WHERE</span> price &gt; <span style="font-weight: bold;">ANY</span> (<span style="font-weight: bold;">SELECT</span> price <span style="font-weight: bold;">FROM</span> clearance);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecedbe7" class="outline-3">
<h3 id="orgecedbe7">Q53. How do you escape a wildcard in LIKE?</h3>
<div class="outline-text-3" id="text-orgecedbe7">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> files <span style="font-weight: bold;">WHERE</span> <span style="font-weight: bold;">name</span> <span style="font-weight: bold;">LIKE</span> <span style="font-style: italic;">'100\%'</span> <span style="font-weight: bold;">ESCAPE</span> <span style="font-style: italic;">'\'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org14d67e0" class="outline-3">
<h3 id="org14d67e0">Q54. What is the difference between COUNT(*), COUNT(column), and COUNT(DISTINCT column)?</h3>
<div class="outline-text-3" id="text-org14d67e0">
<p>
<code>COUNT(*)</code> counts all rows.
<code>COUNT(column)</code> counts non-null values.
<code>COUNT(DISTINCT column)</code> counts unique non-null values.
</p>
</div>
</div>
<div id="outline-container-orgcb5e02f" class="outline-3">
<h3 id="orgcb5e02f">Q55. How do you concatenate multiple rows into one string?</h3>
<div class="outline-text-3" id="text-orgcb5e02f">
<ul class="org-ul">
<li>PostgreSQL: <code>STRING_AGG(name, ', ')</code></li>
<li>MySQL: <code>GROUP_CONCAT(name SEPARATOR ', ')</code></li>
<li>SQL Server: <code>STRING_AGG(name, ', ')</code></li>
<li>Oracle: <code>LISTAGG(name, ', ') WITHIN GROUP (ORDER BY name)</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org46f0460" class="outline-2">
<h2 id="org46f0460">Joins</h2>
<div class="outline-text-2" id="text-org46f0460">
</div>
<div id="outline-container-org7fccf0c" class="outline-3">
<h3 id="org7fccf0c">Q56. What is a JOIN?</h3>
<div class="outline-text-3" id="text-org7fccf0c">
<p>
A JOIN combines rows from two or more tables based on a related column.
</p>
</div>
</div>
<div id="outline-container-org3e85893" class="outline-3">
<h3 id="org3e85893">Q57. What is an INNER JOIN?</h3>
<div class="outline-text-3" id="text-org3e85893">
<p>
Returns only rows where the join condition matches in both tables:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> e.<span style="font-weight: bold;">name</span>, d.<span style="font-weight: bold;">name</span>
<span style="font-weight: bold;">FROM</span> employees e
<span style="font-weight: bold;">INNER</span> <span style="font-weight: bold;">JOIN</span> departments d <span style="font-weight: bold;">ON</span> e.department_id = d.id;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7933ac7" class="outline-3">
<h3 id="org7933ac7">Q58. What is a LEFT (OUTER) JOIN?</h3>
<div class="outline-text-3" id="text-org7933ac7">
<p>
Returns all rows from the left table and matching rows from the right; unmatched right-side columns are <code>NULL</code>.
</p>
</div>
</div>
<div id="outline-container-org55f6403" class="outline-3">
<h3 id="org55f6403">Q59. What is a RIGHT JOIN?</h3>
<div class="outline-text-3" id="text-org55f6403">
<p>
The mirror of LEFT JOIN — all rows from the right table, matched or not.
</p>
</div>
</div>
<div id="outline-container-org8e1dee0" class="outline-3">
<h3 id="org8e1dee0">Q60. What is a FULL OUTER JOIN?</h3>
<div class="outline-text-3" id="text-org8e1dee0">
<p>
Returns all rows from both tables, with <code>NULL</code> where there's no match on either
side. (MySQL lacks it natively; emulate with <code>LEFT JOIN UNION RIGHT JOIN</code>.)
</p>
</div>
</div>
<div id="outline-container-org3d424bb" class="outline-3">
<h3 id="org3d424bb">Q61. What is a CROSS JOIN?</h3>
<div class="outline-text-3" id="text-org3d424bb">
<p>
Produces the Cartesian product — every row of A combined with every row of B.
</p>
</div>
</div>
<div id="outline-container-orga881234" class="outline-3">
<h3 id="orga881234">Q62. What is a self join?</h3>
<div class="outline-text-3" id="text-orga881234">
<p>
A table joined to itself, typically to compare rows or model hierarchies:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> e.<span style="font-weight: bold;">name</span> <span style="font-weight: bold;">AS</span> employee, <span style="font-weight: bold;">m</span>.<span style="font-weight: bold;">name</span> <span style="font-weight: bold;">AS</span> manager
<span style="font-weight: bold;">FROM</span> employees e
<span style="font-weight: bold;">LEFT</span> <span style="font-weight: bold;">JOIN</span> employees <span style="font-weight: bold;">m</span> <span style="font-weight: bold;">ON</span> e.manager_id = <span style="font-weight: bold;">m</span>.id;
</pre>
</div>
</div>
</div>
<div id="outline-container-org052bac6" class="outline-3">
<h3 id="org052bac6">Q63. What is the difference between an equi-join and a non-equi join?</h3>
<div class="outline-text-3" id="text-org052bac6">
<p>
An equi-join uses <code>=</code> in the condition. A non-equi join uses other operators
(<code>&lt;</code>, <code>&gt;</code>, <code>BETWEEN</code>), e.g., joining to a salary-band range table.
</p>
</div>
</div>
