org/posts/sql.org
** Q64. How do you join more than two tables?
Chain JOIN clauses:

#+begin_src sql
SELECT o.id, c.name, p.title
FROM orders o
JOIN customers c ON o.customer_id = c.id
JOIN order_items oi ON oi.order_id = o.id
JOIN products p ON oi.product_id = p.id;
#+end_src

** Q65. What's the difference between ON and WHERE in an outer join?
A condition in =ON= of a LEFT JOIN filters which right rows match (preserving all left rows).
The same condition in =WHERE= filters the final result and can turn the outer join into an inner join.

** Q66. What is USING in a join?
A shorthand when the join columns share the same name:

#+begin_src sql
SELECT * FROM employees JOIN departments USING (department_id);
#+end_src

** Q67. What is a natural join?
Automatically joins on all columns with the same name in both tables.
Avoid it — it's implicit and fragile to schema changes.

** Q68. How do you find rows in table A with no match in table B?
Anti-join via LEFT JOIN + IS NULL:

#+begin_src sql
SELECT c.* FROM customers c
LEFT JOIN orders o ON o.customer_id = c.id
WHERE o.id IS NULL;
#+end_src

** Q69. Why might a JOIN return more rows than expected?
A one-to-many or many-to-many relationship multiplies rows. Duplicate keys on the
joined side fan out the result. Use =DISTINCT= or aggregate appropriately.

** Q70. What is the difference between explicit and implicit join syntax?
Explicit uses =JOIN ... ON=. Implicit lists tables in =FROM= with conditions in
=WHERE= (~FROM a, b WHERE a.id = b.a_id~). Prefer explicit — it's clearer and
avoids accidental cross joins.

** Q71. How do you join on multiple columns?
#+begin_src sql
JOIN ON a.region = b.region AND a.year = b.year
#+end_src

** Q72. Can you join a table to a subquery?
Yes — a derived table:

#+begin_src sql
SELECT e.name, t.total
FROM employees e
JOIN (SELECT employee_id, SUM(amount) total FROM sales GROUP BY employee_id) t
  ON t.employee_id = e.id;
#+end_src

** Q73. What is a lateral join?
A =LATERAL= (PostgreSQL) / =CROSS APPLY= / =OUTER APPLY= (SQL Server) lets a
subquery reference columns from preceding tables in the FROM clause — useful for top-N-per-group.

** Q74. How do you get the top N rows per group using a join?
Use =LATERAL=/=APPLY= or a window function (see Q132). Example with LATERAL:

#+begin_src sql
SELECT d.name, top.name, top.salary
FROM departments d
CROSS JOIN LATERAL (
  SELECT name, salary FROM employees e
  WHERE e.department_id = d.id ORDER BY salary DESC LIMIT 3
) top;
#+end_src

** Q75. What performance considerations apply to joins?
Ensure join columns are indexed, join on the smallest necessary result set,
prefer inner joins when semantics allow, and watch for unintended row multiplication.
The optimizer chooses join algorithms (nested loop, hash, merge) based on statistics.

* Aggregation & Grouping
** Q76. What are aggregate functions?
Functions that compute a single value over a set of rows: =COUNT=, =SUM=, =AVG=, =MIN=, =MAX=.

** Q77. How does GROUP BY work?
It collapses rows sharing the same grouping-column values into one row per group, over which aggregates are computed:

#+begin_src sql
SELECT department_id, AVG(salary)
FROM employees GROUP BY department_id;
#+end_src

** Q78. Can you select a non-aggregated column not in GROUP BY?
No (in standard SQL and most engines) — every selected column must be aggregated or appear in =GROUP BY=.
MySQL historically allowed it with surprising results (=ONLY_FULL_GROUP_BY= now blocks it).

** Q79. How do you filter groups?
With =HAVING=:

#+begin_src sql
SELECT department_id, COUNT(*) AS cnt
FROM employees GROUP BY department_id
HAVING COUNT(*) > 5;
#+end_src

** Q80. How do AVG/SUM treat NULLs?
They ignore NULLs. =AVG= divides by the count of non-null values, which may differ from total row count.

** Q81. What is GROUP BY with multiple columns?
Creates a group for each unique combination of those column values:

#+begin_src sql
SELECT department_id, job_title, COUNT(*)
FROM employees GROUP BY department_id, job_title;
#+end_src

** Q82. What are GROUPING SETS, ROLLUP, and CUBE?
Extensions to compute multiple grouping levels in one query.
=ROLLUP= produces subtotals + grand total along a hierarchy;
=CUBE= produces all combinations;
=GROUPING SETS= lets you list exactly which groupings you want.

#+begin_src sql
SELECT region, product, SUM(sales)
FROM orders GROUP BY ROLLUP (region, product);
#+end_src

