public/posts/sql.html
<div id="outline-container-org9cf85f0" class="outline-3">
<h3 id="org9cf85f0">Q64. How do you join more than two tables?</h3>
<div class="outline-text-3" id="text-org9cf85f0">
<p>
Chain JOIN clauses:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> o.id, c.<span style="font-weight: bold;">name</span>, p.title
<span style="font-weight: bold;">FROM</span> orders o
<span style="font-weight: bold;">JOIN</span> customers c <span style="font-weight: bold;">ON</span> o.customer_id = c.id
<span style="font-weight: bold;">JOIN</span> order_items oi <span style="font-weight: bold;">ON</span> oi.order_id = o.id
<span style="font-weight: bold;">JOIN</span> products p <span style="font-weight: bold;">ON</span> oi.product_id = p.id;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga9b58c0" class="outline-3">
<h3 id="orga9b58c0">Q65. What's the difference between ON and WHERE in an outer join?</h3>
<div class="outline-text-3" id="text-orga9b58c0">
<p>
A condition in <code>ON</code> of a LEFT JOIN filters which right rows match (preserving all left rows).
The same condition in <code>WHERE</code> filters the final result and can turn the outer join into an inner join.
</p>
</div>
</div>
<div id="outline-container-org53c4b60" class="outline-3">
<h3 id="org53c4b60">Q66. What is USING in a join?</h3>
<div class="outline-text-3" id="text-org53c4b60">
<p>
A shorthand when the join columns share the same name:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">JOIN</span> departments <span style="font-weight: bold;">USING</span> (department_id);
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ad50e4" class="outline-3">
<h3 id="org2ad50e4">Q67. What is a natural join?</h3>
<div class="outline-text-3" id="text-org2ad50e4">
<p>
Automatically joins on all columns with the same name in both tables.
Avoid it — it's implicit and fragile to schema changes.
</p>
</div>
</div>
<div id="outline-container-org437c39c" class="outline-3">
<h3 id="org437c39c">Q68. How do you find rows in table A with no match in table B?</h3>
<div class="outline-text-3" id="text-org437c39c">
<p>
Anti-join via LEFT JOIN + IS NULL:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> c.* <span style="font-weight: bold;">FROM</span> customers c
<span style="font-weight: bold;">LEFT</span> <span style="font-weight: bold;">JOIN</span> orders o <span style="font-weight: bold;">ON</span> o.customer_id = c.id
<span style="font-weight: bold;">WHERE</span> o.id <span style="font-weight: bold;">IS</span> <span style="font-weight: bold;">NULL</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc1cc739" class="outline-3">
<h3 id="orgc1cc739">Q69. Why might a JOIN return more rows than expected?</h3>
<div class="outline-text-3" id="text-orgc1cc739">
<p>
A one-to-many or many-to-many relationship multiplies rows. Duplicate keys on the
joined side fan out the result. Use <code>DISTINCT</code> or aggregate appropriately.
</p>
</div>
</div>
<div id="outline-container-org73a33fb" class="outline-3">
<h3 id="org73a33fb">Q70. What is the difference between explicit and implicit join syntax?</h3>
<div class="outline-text-3" id="text-org73a33fb">
<p>
Explicit uses <code>JOIN ... ON</code>. Implicit lists tables in <code>FROM</code> with conditions in
<code>WHERE</code> (<code>FROM a, b WHERE a.id = b.a_id</code>). Prefer explicit — it's clearer and
avoids accidental cross joins.
</p>
</div>
</div>
<div id="outline-container-org2894c52" class="outline-3">
<h3 id="org2894c52">Q71. How do you join on multiple columns?</h3>
<div class="outline-text-3" id="text-org2894c52">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">JOIN</span> <span style="font-weight: bold;">ON</span> a.region = b.region <span style="font-weight: bold;">AND</span> a.<span style="font-weight: bold;">year</span> = b.<span style="font-weight: bold;">year</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c4d760" class="outline-3">
<h3 id="org7c4d760">Q72. Can you join a table to a subquery?</h3>
<div class="outline-text-3" id="text-org7c4d760">
<p>
Yes — a derived table:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> e.<span style="font-weight: bold;">name</span>, t.total
<span style="font-weight: bold;">FROM</span> employees e
<span style="font-weight: bold;">JOIN</span> (<span style="font-weight: bold;">SELECT</span> employee_id, <span style="font-weight: bold;">SUM</span>(amount) total <span style="font-weight: bold;">FROM</span> sales <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> employee_id) t
  <span style="font-weight: bold;">ON</span> t.employee_id = e.id;
</pre>
</div>
</div>
</div>
<div id="outline-container-org3c5d983" class="outline-3">
<h3 id="org3c5d983">Q73. What is a lateral join?</h3>
<div class="outline-text-3" id="text-org3c5d983">
<p>
A <code>LATERAL</code> (PostgreSQL) / <code>CROSS APPLY</code> / <code>OUTER APPLY</code> (SQL Server) lets a
subquery reference columns from preceding tables in the FROM clause — useful for top-N-per-group.
</p>
</div>
</div>
<div id="outline-container-org06c2c3f" class="outline-3">
<h3 id="org06c2c3f">Q74. How do you get the top N rows per group using a join?</h3>
<div class="outline-text-3" id="text-org06c2c3f">
<p>
Use <code>LATERAL=/=APPLY</code> or a window function (see Q132). Example with LATERAL:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> d.<span style="font-weight: bold;">name</span>, top.<span style="font-weight: bold;">name</span>, top.salary
<span style="font-weight: bold;">FROM</span> departments d
<span style="font-weight: bold;">CROSS</span> <span style="font-weight: bold;">JOIN</span> <span style="font-weight: bold;">LATERAL</span> (
  <span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>, salary <span style="font-weight: bold;">FROM</span> employees e
  <span style="font-weight: bold;">WHERE</span> e.department_id = d.id <span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary <span style="font-weight: bold;">DESC</span> <span style="font-weight: bold;">LIMIT</span> 3
) top;
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fecfe9" class="outline-3">
<h3 id="org9fecfe9">Q75. What performance considerations apply to joins?</h3>
<div class="outline-text-3" id="text-org9fecfe9">
<p>
Ensure join columns are indexed, join on the smallest necessary result set,
prefer inner joins when semantics allow, and watch for unintended row multiplication.
The optimizer chooses join algorithms (nested loop, hash, merge) based on statistics.
</p>
</div>
</div>
</div>
<div id="outline-container-org2928c97" class="outline-2">
<h2 id="org2928c97">Aggregation &amp; Grouping</h2>
<div class="outline-text-2" id="text-org2928c97">
</div>
<div id="outline-container-orgcc275a1" class="outline-3">
<h3 id="orgcc275a1">Q76. What are aggregate functions?</h3>
<div class="outline-text-3" id="text-orgcc275a1">
<p>
Functions that compute a single value over a set of rows: <code>COUNT</code>, <code>SUM</code>, <code>AVG</code>, <code>MIN</code>, <code>MAX</code>.
</p>
</div>
</div>
<div id="outline-container-orge286dc9" class="outline-3">
<h3 id="orge286dc9">Q77. How does GROUP BY work?</h3>
<div class="outline-text-3" id="text-orge286dc9">
<p>
It collapses rows sharing the same grouping-column values into one row per group, over which aggregates are computed:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> department_id, <span style="font-weight: bold;">AVG</span>(salary)
<span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> department_id;
</pre>
</div>
</div>
</div>
<div id="outline-container-org95ad334" class="outline-3">
<h3 id="org95ad334">Q78. Can you select a non-aggregated column not in GROUP BY?</h3>
<div class="outline-text-3" id="text-org95ad334">
<p>
No (in standard SQL and most engines) — every selected column must be aggregated or appear in <code>GROUP BY</code>.
MySQL historically allowed it with surprising results (<code>ONLY_FULL_GROUP_BY</code> now blocks it).
</p>
</div>
</div>
<div id="outline-container-org0a6528a" class="outline-3">
<h3 id="org0a6528a">Q79. How do you filter groups?</h3>
<div class="outline-text-3" id="text-org0a6528a">
<p>
With <code>HAVING</code>:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> department_id, <span style="font-weight: bold;">COUNT</span>(*) <span style="font-weight: bold;">AS</span> cnt
<span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> department_id
<span style="font-weight: bold;">HAVING</span> <span style="font-weight: bold;">COUNT</span>(*) &gt; 5;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf159b3d" class="outline-3">
<h3 id="orgf159b3d">Q80. How do AVG/SUM treat NULLs?</h3>
<div class="outline-text-3" id="text-orgf159b3d">
<p>
They ignore NULLs. <code>AVG</code> divides by the count of non-null values, which may differ from total row count.
</p>
</div>
</div>
<div id="outline-container-org77f0505" class="outline-3">
<h3 id="org77f0505">Q81. What is GROUP BY with multiple columns?</h3>
<div class="outline-text-3" id="text-org77f0505">
<p>
Creates a group for each unique combination of those column values:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> department_id, job_title, <span style="font-weight: bold;">COUNT</span>(*)
<span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> department_id, job_title;
</pre>
</div>
</div>
</div>
<div id="outline-container-org0df2b89" class="outline-3">
<h3 id="org0df2b89">Q82. What are GROUPING SETS, ROLLUP, and CUBE?</h3>
<div class="outline-text-3" id="text-org0df2b89">
<p>
Extensions to compute multiple grouping levels in one query.
<code>ROLLUP</code> produces subtotals + grand total along a hierarchy;
<code>CUBE</code> produces all combinations;
<code>GROUPING SETS</code> lets you list exactly which groupings you want.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> region, product, <span style="font-weight: bold;">SUM</span>(sales)
<span style="font-weight: bold;">FROM</span> orders <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> <span style="font-weight: bold;">ROLLUP</span> (region, product);
</pre>
</div>
</div>
</div>
