org/posts/sql.org
** Q83. What does the GROUPING() function do?
Returns 1 if the column is aggregated (a subtotal/grand-total row from
ROLLUP/CUBE) and 0 otherwise — useful for labeling subtotal rows.

** Q84. How do you count rows per group and the percentage of total?
#+begin_src sql
SELECT department_id,
       COUNT(*) AS cnt,
       COUNT(*) * 100.0 / SUM(COUNT(*)) OVER () AS pct
FROM employees GROUP BY department_id;
#+end_src

** Q85. What is the difference between WHERE and HAVING performance-wise?
=WHERE= reduces rows before aggregation (cheaper).
Push conditions into =WHERE= whenever they don't depend on aggregates.

** Q86. How do you find duplicates?
#+begin_src sql
SELECT email, COUNT(*) FROM users
GROUP BY email HAVING COUNT(*) > 1;
#+end_src

** Q87. How do you compute conditional aggregates?
Use CASE inside the aggregate:

#+begin_src sql
SELECT
  SUM(CASE WHEN status = 'paid' THEN amount ELSE 0 END) AS paid_total,
  COUNT(CASE WHEN status = 'open' THEN 1 END) AS open_count
FROM invoices;
#+end_src

PostgreSQL supports =COUNT(*) FILTER (WHERE status = 'open')=.

** Q88. How do you compute a median?
#+begin_src sql
SELECT PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY salary) FROM employees;
#+end_src

** Q89. What is the difference between MIN/MAX and ORDER BY ... LIMIT 1?
=MIN=/=MAX= return a single aggregate value; =ORDER BY ... LIMIT 1= returns the full row.
To get the whole row of the max value, use =ORDER BY ... LIMIT 1= or a window function.

** Q90. Can you nest aggregate functions?
Not directly (e.g., =MAX(AVG(x))= requires a subquery or window).
You compute the inner aggregate in a grouped subquery, then aggregate the result.

* Subqueries & Set Operations
** Q91. What is a subquery?
A query nested inside another query, used in =SELECT=, =FROM=, =WHERE=, or =HAVING=.

** Q92. What is the difference between a correlated and non-correlated subquery?
A *non-correlated* subquery runs once independently.
A *correlated* subquery references the outer query and runs (logically) per outer row.

** Q93. Give an example of a scalar subquery.
Returns a single value:

#+begin_src sql
SELECT name, salary,
  (SELECT AVG(salary) FROM employees) AS avg_salary
FROM employees;
#+end_src

** Q94. How do you use a subquery in WHERE?
#+begin_src sql
SELECT * FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);
#+end_src

** Q95. What is a derived table?
A subquery in the FROM clause treated as a temporary table; it must have an alias.

** Q96. What is the difference between IN and EXISTS performance?
=EXISTS= can short-circuit on the first match and often performs better for
correlated checks and large inner sets. =IN= may be better for small, static
lists. Modern optimizers frequently treat them similarly. Beware =NOT IN= with
NULLs (see Q97).

** Q97. What's the danger of NOT IN with NULLs?
If the subquery returns any =NULL=, =NOT IN= yields no rows because the comparison becomes =UNKNOWN=.
Prefer =NOT EXISTS= or filter out NULLs.

** Q98. What is UNION vs UNION ALL?
=UNION= combines result sets and removes duplicates (sorts/hashes — more expensive).
=UNION ALL= keeps all rows including duplicates and is faster.
Use =UNION ALL= unless you need dedup.

** Q99. What are the rules for set operations?
Each query must have the same number of columns with compatible data types in the same order. Column names come from the first query.

** Q100. What is INTERSECT?
Returns rows present in both result sets. (MySQL added it in 8.0.31; older versions emulate via joins.)

** Q101. What is EXCEPT / MINUS?
Returns rows in the first set not in the second. =EXCEPT= (ANSI/PostgreSQL/SQL Server), =MINUS= (Oracle).

** Q102. How do you replace a value with a default using a subquery?
#+begin_src sql
SELECT name, COALESCE((SELECT MAX(amount) FROM orders o WHERE o.cust_id = c.id), 0) FROM customers c;
#+end_src

** Q103. Can a subquery return multiple columns?
Yes, in row-value comparisons or in the FROM clause. In a scalar context it must return one column and at most one row.

** Q104. How do you find the second-highest salary?
#+begin_src sql
SELECT MAX(salary) FROM employees
WHERE salary < (SELECT MAX(salary) FROM employees);
#+end_src

Or with window functions / =OFFSET 1 LIMIT 1=.

** Q105. What is a semi-join and anti-join?
A *semi-join* returns rows from the left table that have a match on the right
(logically =EXISTS=/=IN=). An *anti-join* returns left rows with no match (=NOT EXISTS=/=NOT IN=).

