public/posts/sql.html
<div id="outline-container-org8b5a072" class="outline-3">
<h3 id="org8b5a072">Q83. What does the GROUPING() function do?</h3>
<div class="outline-text-3" id="text-org8b5a072">
<p>
Returns 1 if the column is aggregated (a subtotal/grand-total row from
ROLLUP/CUBE) and 0 otherwise — useful for labeling subtotal rows.
</p>
</div>
</div>
<div id="outline-container-org493f2ad" class="outline-3">
<h3 id="org493f2ad">Q84. How do you count rows per group and the percentage of total?</h3>
<div class="outline-text-3" id="text-org493f2ad">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> department_id,
       <span style="font-weight: bold;">COUNT</span>(*) <span style="font-weight: bold;">AS</span> cnt,
       <span style="font-weight: bold;">COUNT</span>(*) * 100.0 / <span style="font-weight: bold;">SUM</span>(<span style="font-weight: bold;">COUNT</span>(*)) OVER () <span style="font-weight: bold;">AS</span> pct
<span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> department_id;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8e2740e" class="outline-3">
<h3 id="org8e2740e">Q85. What is the difference between WHERE and HAVING performance-wise?</h3>
<div class="outline-text-3" id="text-org8e2740e">
<p>
<code>WHERE</code> reduces rows before aggregation (cheaper).
Push conditions into <code>WHERE</code> whenever they don't depend on aggregates.
</p>
</div>
</div>
<div id="outline-container-orgdaff1a4" class="outline-3">
<h3 id="orgdaff1a4">Q86. How do you find duplicates?</h3>
<div class="outline-text-3" id="text-orgdaff1a4">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> email, <span style="font-weight: bold;">COUNT</span>(*) <span style="font-weight: bold;">FROM</span> users
<span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> email <span style="font-weight: bold;">HAVING</span> <span style="font-weight: bold;">COUNT</span>(*) &gt; 1;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9dd542" class="outline-3">
<h3 id="orgc9dd542">Q87. How do you compute conditional aggregates?</h3>
<div class="outline-text-3" id="text-orgc9dd542">
<p>
Use CASE inside the aggregate:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span>
  <span style="font-weight: bold;">SUM</span>(<span style="font-weight: bold;">CASE</span> <span style="font-weight: bold;">WHEN</span> status = <span style="font-style: italic;">'paid'</span> <span style="font-weight: bold;">THEN</span> amount <span style="font-weight: bold;">ELSE</span> 0 <span style="font-weight: bold;">END</span>) <span style="font-weight: bold;">AS</span> paid_total,
  <span style="font-weight: bold;">COUNT</span>(<span style="font-weight: bold;">CASE</span> <span style="font-weight: bold;">WHEN</span> status = <span style="font-style: italic;">'open'</span> <span style="font-weight: bold;">THEN</span> 1 <span style="font-weight: bold;">END</span>) <span style="font-weight: bold;">AS</span> open_count
<span style="font-weight: bold;">FROM</span> invoices;
</pre>
</div>

<p>
PostgreSQL supports <code>COUNT(*) FILTER (WHERE status = 'open')</code>.
</p>
</div>
</div>
<div id="outline-container-org3efeb2f" class="outline-3">
<h3 id="org3efeb2f">Q88. How do you compute a median?</h3>
<div class="outline-text-3" id="text-org3efeb2f">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> PERCENTILE_CONT(0.5) WITHIN <span style="font-weight: bold;">GROUP</span> (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary) <span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6bdb608" class="outline-3">
<h3 id="org6bdb608">Q89. What is the difference between MIN/MAX and ORDER BY &#x2026; LIMIT 1?</h3>
<div class="outline-text-3" id="text-org6bdb608">
<p>
<code>MIN=/=MAX</code> return a single aggregate value; <code>ORDER BY ... LIMIT 1</code> returns the full row.
To get the whole row of the max value, use <code>ORDER BY ... LIMIT 1</code> or a window function.
</p>
</div>
</div>
<div id="outline-container-orgd05daae" class="outline-3">
<h3 id="orgd05daae">Q90. Can you nest aggregate functions?</h3>
<div class="outline-text-3" id="text-orgd05daae">
<p>
Not directly (e.g., <code>MAX(AVG(x))</code> requires a subquery or window).
You compute the inner aggregate in a grouped subquery, then aggregate the result.
</p>
</div>
</div>
</div>
<div id="outline-container-orge286390" class="outline-2">
<h2 id="orge286390">Subqueries &amp; Set Operations</h2>
<div class="outline-text-2" id="text-orge286390">
</div>
<div id="outline-container-org845102e" class="outline-3">
<h3 id="org845102e">Q91. What is a subquery?</h3>
<div class="outline-text-3" id="text-org845102e">
<p>
A query nested inside another query, used in <code>SELECT</code>, <code>FROM</code>, <code>WHERE</code>, or <code>HAVING</code>.
</p>
</div>
</div>
<div id="outline-container-org30460c0" class="outline-3">
<h3 id="org30460c0">Q92. What is the difference between a correlated and non-correlated subquery?</h3>
<div class="outline-text-3" id="text-org30460c0">
<p>
A <b>non-correlated</b> subquery runs once independently.
A <b>correlated</b> subquery references the outer query and runs (logically) per outer row.
</p>
</div>
</div>
<div id="outline-container-org50bc815" class="outline-3">
<h3 id="org50bc815">Q93. Give an example of a scalar subquery.</h3>
<div class="outline-text-3" id="text-org50bc815">
<p>
Returns a single value:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>, salary,
  (<span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">AVG</span>(salary) <span style="font-weight: bold;">FROM</span> employees) <span style="font-weight: bold;">AS</span> avg_salary
<span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf55e4a0" class="outline-3">
<h3 id="orgf55e4a0">Q94. How do you use a subquery in WHERE?</h3>
<div class="outline-text-3" id="text-orgf55e4a0">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees
<span style="font-weight: bold;">WHERE</span> salary &gt; (<span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">AVG</span>(salary) <span style="font-weight: bold;">FROM</span> employees);
</pre>
</div>
</div>
</div>
<div id="outline-container-org9277b7b" class="outline-3">
<h3 id="org9277b7b">Q95. What is a derived table?</h3>
<div class="outline-text-3" id="text-org9277b7b">
<p>
A subquery in the FROM clause treated as a temporary table; it must have an alias.
</p>
</div>
</div>
<div id="outline-container-orgea2b5f4" class="outline-3">
<h3 id="orgea2b5f4">Q96. What is the difference between IN and EXISTS performance?</h3>
<div class="outline-text-3" id="text-orgea2b5f4">
<p>
<code>EXISTS</code> can short-circuit on the first match and often performs better for
correlated checks and large inner sets. <code>IN</code> may be better for small, static
lists. Modern optimizers frequently treat them similarly. Beware <code>NOT IN</code> with
NULLs (see Q97).
</p>
</div>
</div>
<div id="outline-container-org5680a63" class="outline-3">
<h3 id="org5680a63">Q97. What's the danger of NOT IN with NULLs?</h3>
<div class="outline-text-3" id="text-org5680a63">
<p>
If the subquery returns any <code>NULL</code>, <code>NOT IN</code> yields no rows because the comparison becomes <code>UNKNOWN</code>.
Prefer <code>NOT EXISTS</code> or filter out NULLs.
</p>
</div>
</div>
<div id="outline-container-org1bc8fa6" class="outline-3">
<h3 id="org1bc8fa6">Q98. What is UNION vs UNION ALL?</h3>
<div class="outline-text-3" id="text-org1bc8fa6">
<p>
<code>UNION</code> combines result sets and removes duplicates (sorts/hashes — more expensive).
<code>UNION ALL</code> keeps all rows including duplicates and is faster.
Use <code>UNION ALL</code> unless you need dedup.
</p>
</div>
</div>
<div id="outline-container-orgc25f459" class="outline-3">
<h3 id="orgc25f459">Q99. What are the rules for set operations?</h3>
<div class="outline-text-3" id="text-orgc25f459">
<p>
Each query must have the same number of columns with compatible data types in the same order. Column names come from the first query.
</p>
</div>
</div>
<div id="outline-container-org302a963" class="outline-3">
<h3 id="org302a963">Q100. What is INTERSECT?</h3>
<div class="outline-text-3" id="text-org302a963">
<p>
Returns rows present in both result sets. (MySQL added it in 8.0.31; older versions emulate via joins.)
</p>
</div>
</div>
<div id="outline-container-orgffa13a3" class="outline-3">
<h3 id="orgffa13a3">Q101. What is EXCEPT / MINUS?</h3>
<div class="outline-text-3" id="text-orgffa13a3">
<p>
Returns rows in the first set not in the second. <code>EXCEPT</code> (ANSI/PostgreSQL/SQL Server), <code>MINUS</code> (Oracle).
</p>
</div>
</div>
<div id="outline-container-org17abca4" class="outline-3">
<h3 id="org17abca4">Q102. How do you replace a value with a default using a subquery?</h3>
<div class="outline-text-3" id="text-org17abca4">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>, <span style="font-weight: bold;">COALESCE</span>((<span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">MAX</span>(amount) <span style="font-weight: bold;">FROM</span> orders o <span style="font-weight: bold;">WHERE</span> o.cust_id = c.id), 0) <span style="font-weight: bold;">FROM</span> customers c;
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b5c418" class="outline-3">
<h3 id="org1b5c418">Q103. Can a subquery return multiple columns?</h3>
<div class="outline-text-3" id="text-org1b5c418">
<p>
Yes, in row-value comparisons or in the FROM clause. In a scalar context it must return one column and at most one row.
</p>
</div>
</div>
<div id="outline-container-orge19c366" class="outline-3">
<h3 id="orge19c366">Q104. How do you find the second-highest salary?</h3>
<div class="outline-text-3" id="text-orge19c366">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">MAX</span>(salary) <span style="font-weight: bold;">FROM</span> employees
<span style="font-weight: bold;">WHERE</span> salary &lt; (<span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">MAX</span>(salary) <span style="font-weight: bold;">FROM</span> employees);
</pre>
</div>

<p>
Or with window functions / <code>OFFSET 1 LIMIT 1</code>.
</p>
</div>
</div>
<div id="outline-container-org800b4bf" class="outline-3">
<h3 id="org800b4bf">Q105. What is a semi-join and anti-join?</h3>
<div class="outline-text-3" id="text-org800b4bf">
<p>
A <b>semi-join</b> returns rows from the left table that have a match on the right
(logically <code>EXISTS=/=IN</code>). An <b>anti-join</b> returns left rows with no match (<code>NOT EXISTS=/=NOT IN</code>).
</p>
</div>
</div>
</div>
