org/posts/sql.org
* DDL, Constraints & Schema Design
** Q106. How do you create a table?
#+begin_src sql
CREATE TABLE employees (
  id          INT PRIMARY KEY,
  first_name  VARCHAR(50) NOT NULL,
  salary      NUMERIC(10,2) DEFAULT 0,
  dept_id     INT REFERENCES departments(id)
);
#+end_src

** Q107. What are the main constraint types?
=PRIMARY KEY=, =FOREIGN KEY=, =UNIQUE=, =NOT NULL=, =CHECK=, =DEFAULT=.

** Q108. What does a CHECK constraint do?
Enforces a boolean condition on column values:

#+begin_src sql
salary NUMERIC CHECK (salary >= 0)
#+end_src

** Q109. What is a UNIQUE constraint, and how does it differ from a primary key?
=UNIQUE= ensures values are distinct but allows one (or, by ANSI rules, multiple)
NULLs and you can have several per table. A primary key disallows NULLs and
there's only one per table.

** Q110. How do you add a column to an existing table?
#+begin_src sql
ALTER TABLE employees ADD COLUMN email VARCHAR(255);
#+end_src

** Q111. How do you drop a column?
#+begin_src sql
ALTER TABLE employees DROP COLUMN email;
#+end_src

** Q112. How do you add a foreign key after creation?
#+begin_src sql
ALTER TABLE employees
ADD CONSTRAINT fk_dept FOREIGN KEY (dept_id) REFERENCES departments(id);
#+end_src

** Q113. What are referential actions ON DELETE / ON UPDATE?
=CASCADE=, =SET NULL=, =SET DEFAULT=, =RESTRICT=, =NO ACTION= — define what happens
to child rows when a referenced parent row is deleted/updated.

** Q114. What is an auto-increment / identity column?
A column that auto-generates sequential values:
=SERIAL=/=GENERATED ... AS IDENTITY= (PostgreSQL),
=AUTO_INCREMENT= (MySQL),
=IDENTITY= (SQL Server), sequences (Oracle).

** Q115. What is normalization?
The process of organizing data to reduce redundancy and improve integrity by decomposing tables and defining relationships.

** Q116. Explain 1NF, 2NF, 3NF.
- *1NF*: atomic values, no repeating groups.
- *2NF*: 1NF + no partial dependency (non-key columns depend on the whole
  composite key).
- *3NF*: 2NF + no transitive dependency (non-key columns depend only on the key).

** Q117. What is BCNF?
Boyce-Codd Normal Form — a stricter 3NF where every determinant is a candidate key.

** Q118. What is denormalization and when is it used?
Intentionally introducing redundancy to improve read performance (e.g., reporting/analytics),
at the cost of update complexity and potential anomalies.

** Q119. What is a view?
A stored named query that behaves like a virtual table:

#+begin_src sql
CREATE VIEW active_employees AS
SELECT * FROM employees WHERE status = 'active';
#+end_src

** Q120. What is a materialized view?
A view whose results are physically stored and periodically refreshed — faster
reads, but data can be stale. Supported in PostgreSQL/Oracle; SQL Server uses
indexed views.

** Q121. Can you update through a view?
Sometimes — simple views over a single table without aggregation/DISTINCT/joins
are often updatable. Complex views are read-only unless you define =INSTEAD OF= triggers.

** Q122. What is a temporary table?
A table that exists only for the session/transaction, useful for staging
intermediate results: =CREATE TEMP TABLE ...= (PostgreSQL), =#temp= (SQL Server).

** Q123. What is a sequence?
A database object that generates a sequence of unique numbers, often used for surrogate keys:

#+begin_src sql
CREATE SEQUENCE order_seq START 1 INCREMENT 1;
SELECT NEXTVAL('order_seq');
#+end_src

** Q124. What data types should you use for money?
Use exact numeric types (=NUMERIC=/=DECIMAL=), never floating point
(=FLOAT=/=REAL=), to avoid rounding errors.

** Q125. What is a partitioned table?
A logically single table split into physical partitions (by range, list, or hash)
to improve manageability and query performance on very large datasets.

* Window Functions & CTEs
** Q126. What is a window function?
A function that computes a value across a set of rows ("window") related to the current row, without collapsing rows like =GROUP BY= does.

** Q127. What is the basic syntax of a window function?
#+begin_src sql
SELECT name, department_id,
  AVG(salary) OVER (PARTITION BY department_id) AS dept_avg
FROM employees;
#+end_src

** Q128. What is the difference between PARTITION BY and GROUP BY?
=GROUP BY= reduces rows to one per group. =PARTITION BY= keeps all rows but resets the window's calculation per partition.

