public/posts/sql.html
<div id="outline-container-orga722ad8" class="outline-2">
<h2 id="orga722ad8">DDL, Constraints &amp; Schema Design</h2>
<div class="outline-text-2" id="text-orga722ad8">
</div>
<div id="outline-container-org6b4aafc" class="outline-3">
<h3 id="org6b4aafc">Q106. How do you create a table?</h3>
<div class="outline-text-3" id="text-org6b4aafc">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">employees</span> (
  id          <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">PRIMARY</span> <span style="font-weight: bold;">KEY</span>,
  first_name  <span style="font-weight: bold; text-decoration: underline;">VARCHAR</span>(50) <span style="font-weight: bold;">NOT</span> <span style="font-weight: bold;">NULL</span>,
  salary      <span style="font-weight: bold; text-decoration: underline;">NUMERIC</span>(10,2) <span style="font-weight: bold;">DEFAULT</span> 0,
  dept_id     <span style="font-weight: bold; text-decoration: underline;">INT</span> <span style="font-weight: bold;">REFERENCES</span> departments(id)
);
</pre>
</div>
</div>
</div>
<div id="outline-container-org1bd6081" class="outline-3">
<h3 id="org1bd6081">Q107. What are the main constraint types?</h3>
<div class="outline-text-3" id="text-org1bd6081">
<p>
<code>PRIMARY KEY</code>, <code>FOREIGN KEY</code>, <code>UNIQUE</code>, <code>NOT NULL</code>, <code>CHECK</code>, <code>DEFAULT</code>.
</p>
</div>
</div>
<div id="outline-container-org6fffdda" class="outline-3">
<h3 id="org6fffdda">Q108. What does a CHECK constraint do?</h3>
<div class="outline-text-3" id="text-org6fffdda">
<p>
Enforces a boolean condition on column values:
</p>

<div class="org-src-container">
<pre class="src src-sql">salary <span style="font-weight: bold; text-decoration: underline;">NUMERIC</span> <span style="font-weight: bold;">CHECK</span> (salary &gt;= 0)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8befd58" class="outline-3">
<h3 id="org8befd58">Q109. What is a UNIQUE constraint, and how does it differ from a primary key?</h3>
<div class="outline-text-3" id="text-org8befd58">
<p>
<code>UNIQUE</code> ensures values are distinct but allows one (or, by ANSI rules, multiple)
NULLs and you can have several per table. A primary key disallows NULLs and
there's only one per table.
</p>
</div>
</div>
<div id="outline-container-org2d21aa2" class="outline-3">
<h3 id="org2d21aa2">Q110. How do you add a column to an existing table?</h3>
<div class="outline-text-3" id="text-org2d21aa2">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">ALTER</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">employees</span> <span style="font-weight: bold;">ADD</span> <span style="font-weight: bold;">COLUMN</span> email <span style="font-weight: bold; text-decoration: underline;">VARCHAR</span>(255);
</pre>
</div>
</div>
</div>
<div id="outline-container-org87988e3" class="outline-3">
<h3 id="org87988e3">Q111. How do you drop a column?</h3>
<div class="outline-text-3" id="text-org87988e3">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">ALTER</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">employees</span> <span style="font-weight: bold;">DROP</span> <span style="font-weight: bold;">COLUMN</span> email;
</pre>
</div>
</div>
</div>
<div id="outline-container-org36c60b5" class="outline-3">
<h3 id="org36c60b5">Q112. How do you add a foreign key after creation?</h3>
<div class="outline-text-3" id="text-org36c60b5">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">ALTER</span> <span style="font-weight: bold;">TABLE</span> <span style="font-weight: bold;">employees</span>
<span style="font-weight: bold;">ADD</span> <span style="font-weight: bold;">CONSTRAINT</span> fk_dept <span style="font-weight: bold;">FOREIGN</span> <span style="font-weight: bold;">KEY</span> (dept_id) <span style="font-weight: bold;">REFERENCES</span> departments(id);
</pre>
</div>
</div>
</div>
<div id="outline-container-org4256df8" class="outline-3">
<h3 id="org4256df8">Q113. What are referential actions ON DELETE / ON UPDATE?</h3>
<div class="outline-text-3" id="text-org4256df8">
<p>
<code>CASCADE</code>, <code>SET NULL</code>, <code>SET DEFAULT</code>, <code>RESTRICT</code>, <code>NO ACTION</code> — define what happens
to child rows when a referenced parent row is deleted/updated.
</p>
</div>
</div>
<div id="outline-container-org357e768" class="outline-3">
<h3 id="org357e768">Q114. What is an auto-increment / identity column?</h3>
<div class="outline-text-3" id="text-org357e768">
<p>
A column that auto-generates sequential values:
<code>SERIAL=/=GENERATED ... AS IDENTITY</code> (PostgreSQL),
<code>AUTO_INCREMENT</code> (MySQL),
<code>IDENTITY</code> (SQL Server), sequences (Oracle).
</p>
</div>
</div>
<div id="outline-container-org23e2a44" class="outline-3">
<h3 id="org23e2a44">Q115. What is normalization?</h3>
<div class="outline-text-3" id="text-org23e2a44">
<p>
The process of organizing data to reduce redundancy and improve integrity by decomposing tables and defining relationships.
</p>
</div>
</div>
<div id="outline-container-orgea7f69e" class="outline-3">
<h3 id="orgea7f69e">Q116. Explain 1NF, 2NF, 3NF.</h3>
<div class="outline-text-3" id="text-orgea7f69e">
<ul class="org-ul">
<li><b>1NF</b>: atomic values, no repeating groups.</li>
<li><b>2NF</b>: 1NF + no partial dependency (non-key columns depend on the whole
composite key).</li>
<li><b>3NF</b>: 2NF + no transitive dependency (non-key columns depend only on the key).</li>
</ul>
</div>
</div>
<div id="outline-container-orgfb99f4b" class="outline-3">
<h3 id="orgfb99f4b">Q117. What is BCNF?</h3>
<div class="outline-text-3" id="text-orgfb99f4b">
<p>
Boyce-Codd Normal Form — a stricter 3NF where every determinant is a candidate key.
</p>
</div>
</div>
<div id="outline-container-org2eb8d2e" class="outline-3">
<h3 id="org2eb8d2e">Q118. What is denormalization and when is it used?</h3>
<div class="outline-text-3" id="text-org2eb8d2e">
<p>
Intentionally introducing redundancy to improve read performance (e.g., reporting/analytics),
at the cost of update complexity and potential anomalies.
</p>
</div>
</div>
<div id="outline-container-orge00fde8" class="outline-3">
<h3 id="orge00fde8">Q119. What is a view?</h3>
<div class="outline-text-3" id="text-orge00fde8">
<p>
A stored named query that behaves like a virtual table:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">VIEW</span> <span style="font-weight: bold;">active_employees</span> <span style="font-weight: bold;">AS</span>
<span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> status = <span style="font-style: italic;">'active'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org653d3bf" class="outline-3">
<h3 id="org653d3bf">Q120. What is a materialized view?</h3>
<div class="outline-text-3" id="text-org653d3bf">
<p>
A view whose results are physically stored and periodically refreshed — faster
reads, but data can be stale. Supported in PostgreSQL/Oracle; SQL Server uses
indexed views.
</p>
</div>
</div>
<div id="outline-container-orgb83d6ab" class="outline-3">
<h3 id="orgb83d6ab">Q121. Can you update through a view?</h3>
<div class="outline-text-3" id="text-orgb83d6ab">
<p>
Sometimes — simple views over a single table without aggregation/DISTINCT/joins
are often updatable. Complex views are read-only unless you define <code>INSTEAD OF</code> triggers.
</p>
</div>
</div>
<div id="outline-container-org4143cd5" class="outline-3">
<h3 id="org4143cd5">Q122. What is a temporary table?</h3>
<div class="outline-text-3" id="text-org4143cd5">
<p>
A table that exists only for the session/transaction, useful for staging
intermediate results: <code>CREATE TEMP TABLE ...</code> (PostgreSQL), <code>#temp</code> (SQL Server).
</p>
</div>
</div>
<div id="outline-container-orgffcd29a" class="outline-3">
<h3 id="orgffcd29a">Q123. What is a sequence?</h3>
<div class="outline-text-3" id="text-orgffcd29a">
<p>
A database object that generates a sequence of unique numbers, often used for surrogate keys:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> <span style="font-weight: bold;">SEQUENCE</span> <span style="font-weight: bold;">order_seq</span> <span style="font-weight: bold;">START</span> 1 INCREMENT 1;
<span style="font-weight: bold;">SELECT</span> NEXTVAL(<span style="font-style: italic;">'order_seq'</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf527715" class="outline-3">
<h3 id="orgf527715">Q124. What data types should you use for money?</h3>
<div class="outline-text-3" id="text-orgf527715">
<p>
Use exact numeric types (<code>NUMERIC=/=DECIMAL</code>), never floating point
(<code>FLOAT=/=REAL</code>), to avoid rounding errors.
</p>
</div>
</div>
<div id="outline-container-orgc961108" class="outline-3">
<h3 id="orgc961108">Q125. What is a partitioned table?</h3>
<div class="outline-text-3" id="text-orgc961108">
<p>
A logically single table split into physical partitions (by range, list, or hash)
to improve manageability and query performance on very large datasets.
</p>
</div>
</div>
</div>
<div id="outline-container-org6766046" class="outline-2">
<h2 id="org6766046">Window Functions &amp; CTEs</h2>
<div class="outline-text-2" id="text-org6766046">
</div>
<div id="outline-container-orgdb28fbc" class="outline-3">
<h3 id="orgdb28fbc">Q126. What is a window function?</h3>
<div class="outline-text-3" id="text-orgdb28fbc">
<p>
A function that computes a value across a set of rows ("window") related to the current row, without collapsing rows like <code>GROUP BY</code> does.
</p>
</div>
</div>
<div id="outline-container-orgf074c73" class="outline-3">
<h3 id="orgf074c73">Q127. What is the basic syntax of a window function?</h3>
<div class="outline-text-3" id="text-orgf074c73">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>, department_id,
  <span style="font-weight: bold;">AVG</span>(salary) OVER (PARTITION <span style="font-weight: bold;">BY</span> department_id) <span style="font-weight: bold;">AS</span> dept_avg
<span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org426a8c3" class="outline-3">
<h3 id="org426a8c3">Q128. What is the difference between PARTITION BY and GROUP BY?</h3>
<div class="outline-text-3" id="text-org426a8c3">
<p>
<code>GROUP BY</code> reduces rows to one per group. <code>PARTITION BY</code> keeps all rows but resets the window's calculation per partition.
</p>
</div>
</div>
