org/posts/sql.org
** Q129. What are ROW_NUMBER, RANK, and DENSE_RANK?
- =ROW_NUMBER()=: unique sequential number, no ties handling.
- =RANK()=: ties get the same rank, leaving gaps.
- =DENSE_RANK()=: ties get the same rank, no gaps.

#+begin_src sql
SELECT name, salary,
  ROW_NUMBER() OVER (ORDER BY salary DESC) AS rn,
  RANK()       OVER (ORDER BY salary DESC) AS rnk,
  DENSE_RANK() OVER (ORDER BY salary DESC) AS drnk
FROM employees;
#+end_src

** Q130. What are LAG and LEAD?
Access a prior or following row's value without a self-join:

#+begin_src sql
SELECT month, revenue,
  LAG(revenue) OVER (ORDER BY month) AS prev_month,
  revenue - LAG(revenue) OVER (ORDER BY month) AS delta
FROM monthly_sales;
#+end_src

** Q131. What are FIRST_VALUE, LAST_VALUE, and NTH_VALUE?
Return the first/last/nth value in the window frame. Watch the frame clause —
=LAST_VALUE= often needs =ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING= to behave intuitively.

** Q132. How do you select the top N rows per group?
#+begin_src sql
SELECT * FROM (
  SELECT *, ROW_NUMBER() OVER (PARTITION BY dept_id ORDER BY salary DESC) AS rn
  FROM employees
) t WHERE rn <= 3;
#+end_src

** Q133. What is a window frame (ROWS vs RANGE)?
The frame defines which rows around the current row are included. =ROWS= counts
physical rows; =RANGE= includes rows with equal ordering values (logical range).
E.g., =ROWS BETWEEN 2 PRECEDING AND CURRENT ROW= for a 3-row moving average.

** Q134. How do you compute a running total?
#+begin_src sql
SELECT order_date, amount,
  SUM(amount) OVER (ORDER BY order_date
                    ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total
FROM orders;
#+end_src

** Q135. How do you compute a moving average?
#+begin_src sql
SELECT day, value,
  AVG(value) OVER (ORDER BY day ROWS BETWEEN 6 PRECEDING AND CURRENT ROW) AS ma7
FROM metrics;
#+end_src

** Q136. What is NTILE?
Divides rows into N roughly equal buckets — useful for quartiles/percentiles:

#+begin_src sql
SELECT name, NTILE(4) OVER (ORDER BY salary) AS quartile FROM employees;
#+end_src

** Q137. Can you use window functions in WHERE?
No — windows are computed after WHERE. Wrap the query in a subquery/CTE and filter on the window column in the outer query.

** Q138. What is a CTE (Common Table Expression)?
A named temporary result set defined with =WITH=, improving readability and
enabling recursion:

#+begin_src sql
WITH high_earners AS (
  SELECT * FROM employees WHERE salary > 100000
)
SELECT department_id, COUNT(*) FROM high_earners GROUP BY department_id;
#+end_src

** Q139. What is the difference between a CTE and a subquery?
Functionally similar; CTEs are named, can be referenced multiple times, and
support recursion. They're often clearer for complex queries. (Materialization
behavior varies by engine.)

** Q140. What is a recursive CTE?
A CTE that references itself, used for hierarchies and graph traversal:

#+begin_src sql
WITH RECURSIVE org AS (
  SELECT id, name, manager_id, 1 AS lvl FROM employees WHERE manager_id IS NULL
  UNION ALL
  SELECT e.id, e.name, e.manager_id, o.lvl + 1
  FROM employees e JOIN org o ON e.manager_id = o.id
)
SELECT * FROM org;
#+end_src

** Q141. What can go wrong with recursive CTEs?
Infinite loops if the data has cycles. Many engines provide cycle detection (=CYCLE= clause in PostgreSQL)
or you can track visited nodes; always ensure the recursion terminates.

** Q142. Can you define multiple CTEs in one query?
Yes, comma-separated:

#+begin_src sql
WITH a AS (...), b AS (...) SELECT * FROM a JOIN b ON ...;
#+end_src

** Q143. Are CTEs always materialized?
Not necessarily. PostgreSQL pre-12 always materialized; 12+ may inline
non-recursive CTEs. You can force with =MATERIALIZED=/=NOT MATERIALIZED=.

** Q144. How do you deduplicate keeping the latest row per key?

#+begin_src sql
WITH ranked AS (
  SELECT *, ROW_NUMBER() OVER (PARTITION BY email ORDER BY updated_at DESC) rn FROM users
  )
DELETE FROM users WHERE id IN (SELECT id FROM ranked WHERE rn > 1);
#+end_src

