public/posts/sql.html
<div id="outline-container-orge718982" class="outline-3">
<h3 id="orge718982">Q129. What are ROW<sub>NUMBER</sub>, RANK, and DENSE<sub>RANK</sub>?</h3>
<div class="outline-text-3" id="text-orge718982">
<ul class="org-ul">
<li><code>ROW_NUMBER()</code>: unique sequential number, no ties handling.</li>
<li><code>RANK()</code>: ties get the same rank, leaving gaps.</li>
<li><code>DENSE_RANK()</code>: ties get the same rank, no gaps.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>, salary,
  ROW_NUMBER() OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary <span style="font-weight: bold;">DESC</span>) <span style="font-weight: bold;">AS</span> rn,
  RANK()       OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary <span style="font-weight: bold;">DESC</span>) <span style="font-weight: bold;">AS</span> rnk,
  DENSE_RANK() OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary <span style="font-weight: bold;">DESC</span>) <span style="font-weight: bold;">AS</span> drnk
<span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-org757d888" class="outline-3">
<h3 id="org757d888">Q130. What are LAG and LEAD?</h3>
<div class="outline-text-3" id="text-org757d888">
<p>
Access a prior or following row's value without a self-join:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">month</span>, revenue,
  LAG(revenue) OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> <span style="font-weight: bold;">month</span>) <span style="font-weight: bold;">AS</span> prev_month,
  revenue - LAG(revenue) OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> <span style="font-weight: bold;">month</span>) <span style="font-weight: bold;">AS</span> delta
<span style="font-weight: bold;">FROM</span> monthly_sales;
</pre>
</div>
</div>
</div>
<div id="outline-container-org5203612" class="outline-3">
<h3 id="org5203612">Q131. What are FIRST<sub>VALUE</sub>, LAST<sub>VALUE</sub>, and NTH<sub>VALUE</sub>?</h3>
<div class="outline-text-3" id="text-org5203612">
<p>
Return the first/last/nth value in the window frame. Watch the frame clause —
<code>LAST_VALUE</code> often needs <code>ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING</code> to behave intuitively.
</p>
</div>
</div>
<div id="outline-container-org8109f76" class="outline-3">
<h3 id="org8109f76">Q132. How do you select the top N rows per group?</h3>
<div class="outline-text-3" id="text-org8109f76">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> (
  <span style="font-weight: bold;">SELECT</span> *, ROW_NUMBER() OVER (PARTITION <span style="font-weight: bold;">BY</span> dept_id <span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary <span style="font-weight: bold;">DESC</span>) <span style="font-weight: bold;">AS</span> rn
  <span style="font-weight: bold;">FROM</span> employees
) t <span style="font-weight: bold;">WHERE</span> rn &lt;= 3;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca476b8" class="outline-3">
<h3 id="orgca476b8">Q133. What is a window frame (ROWS vs RANGE)?</h3>
<div class="outline-text-3" id="text-orgca476b8">
<p>
The frame defines which rows around the current row are included. <code>ROWS</code> counts
physical rows; <code>RANGE</code> includes rows with equal ordering values (logical range).
E.g., <code>ROWS BETWEEN 2 PRECEDING AND CURRENT ROW</code> for a 3-row moving average.
</p>
</div>
</div>
<div id="outline-container-org0925ec4" class="outline-3">
<h3 id="org0925ec4">Q134. How do you compute a running total?</h3>
<div class="outline-text-3" id="text-org0925ec4">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> order_date, amount,
  <span style="font-weight: bold;">SUM</span>(amount) OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> order_date
                    <span style="font-weight: bold;">ROWS</span> <span style="font-weight: bold;">BETWEEN</span> UNBOUNDED PRECEDING <span style="font-weight: bold;">AND</span> <span style="font-weight: bold;">CURRENT</span> <span style="font-weight: bold; text-decoration: underline;">ROW</span>) <span style="font-weight: bold;">AS</span> running_total
<span style="font-weight: bold;">FROM</span> orders;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab9f8af" class="outline-3">
<h3 id="orgab9f8af">Q135. How do you compute a moving average?</h3>
<div class="outline-text-3" id="text-orgab9f8af">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">day</span>, <span style="font-weight: bold;">value</span>,
  <span style="font-weight: bold;">AVG</span>(<span style="font-weight: bold;">value</span>) OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> <span style="font-weight: bold;">day</span> <span style="font-weight: bold;">ROWS</span> <span style="font-weight: bold;">BETWEEN</span> 6 PRECEDING <span style="font-weight: bold;">AND</span> <span style="font-weight: bold;">CURRENT</span> <span style="font-weight: bold; text-decoration: underline;">ROW</span>) <span style="font-weight: bold;">AS</span> ma7
<span style="font-weight: bold;">FROM</span> metrics;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc19f7e" class="outline-3">
<h3 id="orgfc19f7e">Q136. What is NTILE?</h3>
<div class="outline-text-3" id="text-orgfc19f7e">
<p>
Divides rows into N roughly equal buckets — useful for quartiles/percentiles:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">name</span>, NTILE(4) OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> salary) <span style="font-weight: bold;">AS</span> quartile <span style="font-weight: bold;">FROM</span> employees;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga97a0f5" class="outline-3">
<h3 id="orga97a0f5">Q137. Can you use window functions in WHERE?</h3>
<div class="outline-text-3" id="text-orga97a0f5">
<p>
No — windows are computed after WHERE. Wrap the query in a subquery/CTE and filter on the window column in the outer query.
</p>
</div>
</div>
<div id="outline-container-org8ab390e" class="outline-3">
<h3 id="org8ab390e">Q138. What is a CTE (Common Table Expression)?</h3>
<div class="outline-text-3" id="text-org8ab390e">
<p>
A named temporary result set defined with <code>WITH</code>, improving readability and
enabling recursion:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">WITH</span> high_earners <span style="font-weight: bold;">AS</span> (
  <span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> salary &gt; 100000
)
<span style="font-weight: bold;">SELECT</span> department_id, <span style="font-weight: bold;">COUNT</span>(*) <span style="font-weight: bold;">FROM</span> high_earners <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> department_id;
</pre>
</div>
</div>
</div>
<div id="outline-container-org57574b2" class="outline-3">
<h3 id="org57574b2">Q139. What is the difference between a CTE and a subquery?</h3>
<div class="outline-text-3" id="text-org57574b2">
<p>
Functionally similar; CTEs are named, can be referenced multiple times, and
support recursion. They're often clearer for complex queries. (Materialization
behavior varies by engine.)
</p>
</div>
</div>
<div id="outline-container-orga4c09e2" class="outline-3">
<h3 id="orga4c09e2">Q140. What is a recursive CTE?</h3>
<div class="outline-text-3" id="text-orga4c09e2">
<p>
A CTE that references itself, used for hierarchies and graph traversal:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">WITH</span> <span style="font-weight: bold;">RECURSIVE</span> org <span style="font-weight: bold;">AS</span> (
  <span style="font-weight: bold;">SELECT</span> id, <span style="font-weight: bold;">name</span>, manager_id, 1 <span style="font-weight: bold;">AS</span> lvl <span style="font-weight: bold;">FROM</span> employees <span style="font-weight: bold;">WHERE</span> manager_id <span style="font-weight: bold;">IS</span> <span style="font-weight: bold;">NULL</span>
  <span style="font-weight: bold;">UNION</span> <span style="font-weight: bold;">ALL</span>
  <span style="font-weight: bold;">SELECT</span> e.id, e.<span style="font-weight: bold;">name</span>, e.manager_id, o.lvl + 1
  <span style="font-weight: bold;">FROM</span> employees e <span style="font-weight: bold;">JOIN</span> org o <span style="font-weight: bold;">ON</span> e.manager_id = o.id
)
<span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> org;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf159a7d" class="outline-3">
<h3 id="orgf159a7d">Q141. What can go wrong with recursive CTEs?</h3>
<div class="outline-text-3" id="text-orgf159a7d">
<p>
Infinite loops if the data has cycles. Many engines provide cycle detection (<code>CYCLE</code> clause in PostgreSQL)
or you can track visited nodes; always ensure the recursion terminates.
</p>
</div>
</div>
<div id="outline-container-orgb203c3d" class="outline-3">
<h3 id="orgb203c3d">Q142. Can you define multiple CTEs in one query?</h3>
<div class="outline-text-3" id="text-orgb203c3d">
<p>
Yes, comma-separated:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">WITH</span> a <span style="font-weight: bold;">AS</span> (...), b <span style="font-weight: bold;">AS</span> (...) <span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> a <span style="font-weight: bold;">JOIN</span> b <span style="font-weight: bold;">ON</span> ...;
</pre>
</div>
</div>
</div>
<div id="outline-container-org324f1c1" class="outline-3">
<h3 id="org324f1c1">Q143. Are CTEs always materialized?</h3>
<div class="outline-text-3" id="text-org324f1c1">
<p>
Not necessarily. PostgreSQL pre-12 always materialized; 12+ may inline
non-recursive CTEs. You can force with <code>MATERIALIZED=/=NOT MATERIALIZED</code>.
</p>
</div>
</div>
<div id="outline-container-orgcce8014" class="outline-3">
<h3 id="orgcce8014">Q144. How do you deduplicate keeping the latest row per key?</h3>
<div class="outline-text-3" id="text-orgcce8014">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">WITH</span> ranked <span style="font-weight: bold;">AS</span> (
  <span style="font-weight: bold;">SELECT</span> *, ROW_NUMBER() OVER (PARTITION <span style="font-weight: bold;">BY</span> email <span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> updated_at <span style="font-weight: bold;">DESC</span>) rn <span style="font-weight: bold;">FROM</span> users
  )
<span style="font-weight: bold;">DELETE</span> <span style="font-weight: bold;">FROM</span> users <span style="font-weight: bold;">WHERE</span> id <span style="font-weight: bold;">IN</span> (<span style="font-weight: bold;">SELECT</span> id <span style="font-weight: bold;">FROM</span> ranked <span style="font-weight: bold;">WHERE</span> rn &gt; 1);
</pre>
</div>
</div>
</div>
