org/posts/sql.org
** Q145. What is PERCENT_RANK and CUME_DIST?
=PERCENT_RANK()= gives relative rank between 0 and 1. =CUME_DIST()= gives
cumulative distribution — the fraction of rows ≤ the current row's value.

* Transactions & Concurrency
** Q146. What is a transaction?
A unit of work that is executed atomically — all operations succeed (=COMMIT=) or none take effect (=ROLLBACK=).

** Q147. What are the ACID properties?
- *Atomicity*: all-or-nothing.
- *Consistency*: transitions leave the DB in a valid state.
- *Isolation*: concurrent transactions don't interfere visibly.
- *Durability*: committed changes survive crashes.

** Q148. How do you write a transaction?
#+begin_src sql
BEGIN;
UPDATE accounts SET balance = balance - 100 WHERE id = 1;
UPDATE accounts SET balance = balance + 100 WHERE id = 2;
COMMIT;  -- or ROLLBACK on error
#+end_src

** Q149. What is a savepoint?
A marker within a transaction you can roll back to without aborting the whole transaction:

#+begin_src sql
SAVEPOINT sp1;
-- ...
ROLLBACK TO sp1;
#+end_src

** Q150. What are the SQL isolation levels?
From weakest to strongest: =READ UNCOMMITTED=, =READ COMMITTED=, =REPEATABLE READ=, =SERIALIZABLE=.

** Q151. What concurrency anomalies do isolation levels prevent?
- *Dirty read*: reading uncommitted data — prevented at READ COMMITTED+.
- *Non-repeatable read*: a row changes between reads — prevented at REPEATABLE READ+.
- *Phantom read*: new rows appear in a range between reads — prevented at SERIALIZABLE.

** Q152. What is the default isolation level?
PostgreSQL/Oracle/SQL Server default to =READ COMMITTED=; MySQL (InnoDB) defaults to =REPEATABLE READ=.

** Q153. What is optimistic vs pessimistic locking?
*Pessimistic* locks rows up front (=SELECT ... FOR UPDATE=). *Optimistic* assumes
no conflict and checks a version/timestamp column at write time, retrying on mismatch.

** Q154. What is SELECT ... FOR UPDATE?
Locks the selected rows so other transactions can't modify them until the current
transaction ends — used to safely read-then-update.

** Q155. What is a deadlock?
Two transactions each hold a lock the other needs, blocking forever. The DB
detects it and aborts one (the "victim"). Mitigate by acquiring locks in a
consistent order and keeping transactions short.

** Q156. What is MVCC?
Multi-Version Concurrency Control — readers see a consistent snapshot without
blocking writers (and vice versa) by keeping multiple row versions. Used by
PostgreSQL, Oracle, MySQL InnoDB.

** Q157. What is the difference between a shared and exclusive lock?
A *shared (read)* lock allows other shared locks but blocks writes. An *exclusive
(write)* lock blocks all other locks.

** Q158. What happens if you don't commit?
Changes remain in the transaction's scope and are invisible to others; an open
transaction can hold locks and bloat undo/WAL. On disconnect, most engines roll
back uncommitted work.

** Q159. What is autocommit?
A mode where each statement is its own transaction, committed immediately. Most
clients enable it by default; disable it to batch statements into one transaction.

** Q160. How do you handle a serialization failure?
Under =SERIALIZABLE=/optimistic schemes, conflicting transactions get a
serialization error; the application should catch it and retry the transaction.

* Indexing & Performance
** Q161. What is an index?
A data structure (usually a B-tree) that speeds up row lookup at the cost of extra
storage and slower writes.

** Q162. What is the difference between a clustered and non-clustered index?
A *clustered* index determines the physical row order (the table /is/ the index;
one per table). A *non-clustered* index is a separate structure pointing to rows.
(SQL Server terminology; PostgreSQL heap tables differ.)

** Q163. When does an index help vs. hurt?
Helps selective lookups, joins, ORDER BY, and range scans. Hurts
INSERT/UPDATE/DELETE performance and consumes space. Over-indexing degrades writes.

** Q164. What is a composite index, and does column order matter?
An index on multiple columns. Order matters: an index on =(a, b)= supports
filtering on =a= or =a, b= but not =b= alone (left-most prefix rule).

** Q165. What is a covering index?
An index that contains all columns a query needs, so the engine answers from the
index without touching the table ("index-only scan"). SQL Server uses =INCLUDE=
columns.

** Q166. Why might an index not be used?
Low selectivity, functions wrapping the column (~WHERE UPPER(name)=...~), implicit
type conversions, leading wildcard ~LIKE '%x'~, stale statistics, or the optimizer
estimating a scan is cheaper.

** Q167. What is a query execution plan?
The optimizer's chosen strategy to run a query (scans, joins, order). View it with
=EXPLAIN=/=EXPLAIN ANALYZE= (PostgreSQL/MySQL) or =SET SHOWPLAN= execution plan (SQL Server).

** Q168. What's the difference between an index seek and an index scan?
A *seek* navigates directly to qualifying rows (efficient, selective).
A *scan* reads the whole index/table. Seeks are generally preferable for selective queries.

