public/posts/sql.html
<div id="outline-container-orgd74f1fd" class="outline-3">
<h3 id="orgd74f1fd">Q145. What is PERCENT<sub>RANK</sub> and CUME<sub>DIST</sub>?</h3>
<div class="outline-text-3" id="text-orgd74f1fd">
<p>
<code>PERCENT_RANK()</code> gives relative rank between 0 and 1. <code>CUME_DIST()</code> gives
cumulative distribution — the fraction of rows ≤ the current row's value.
</p>
</div>
</div>
</div>
<div id="outline-container-org06b5132" class="outline-2">
<h2 id="org06b5132">Transactions &amp; Concurrency</h2>
<div class="outline-text-2" id="text-org06b5132">
</div>
<div id="outline-container-orgf7d68ad" class="outline-3">
<h3 id="orgf7d68ad">Q146. What is a transaction?</h3>
<div class="outline-text-3" id="text-orgf7d68ad">
<p>
A unit of work that is executed atomically — all operations succeed (<code>COMMIT</code>) or none take effect (<code>ROLLBACK</code>).
</p>
</div>
</div>
<div id="outline-container-org18e31aa" class="outline-3">
<h3 id="org18e31aa">Q147. What are the ACID properties?</h3>
<div class="outline-text-3" id="text-org18e31aa">
<ul class="org-ul">
<li><b>Atomicity</b>: all-or-nothing.</li>
<li><b>Consistency</b>: transitions leave the DB in a valid state.</li>
<li><b>Isolation</b>: concurrent transactions don't interfere visibly.</li>
<li><b>Durability</b>: committed changes survive crashes.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9097af" class="outline-3">
<h3 id="orgd9097af">Q148. How do you write a transaction?</h3>
<div class="outline-text-3" id="text-orgd9097af">
<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">BEGIN</span>;
<span style="font-weight: bold;">UPDATE</span> accounts <span style="font-weight: bold;">SET</span> balance = balance - 100 <span style="font-weight: bold;">WHERE</span> id = 1;
<span style="font-weight: bold;">UPDATE</span> accounts <span style="font-weight: bold;">SET</span> balance = balance + 100 <span style="font-weight: bold;">WHERE</span> id = 2;
<span style="font-weight: bold;">COMMIT</span>;  <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">or ROLLBACK on error</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f45030" class="outline-3">
<h3 id="org5f45030">Q149. What is a savepoint?</h3>
<div class="outline-text-3" id="text-org5f45030">
<p>
A marker within a transaction you can roll back to without aborting the whole transaction:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SAVEPOINT</span> sp1;
<span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">...
</span><span style="font-weight: bold;">ROLLBACK</span> <span style="font-weight: bold;">TO</span> sp1;
</pre>
</div>
</div>
</div>
<div id="outline-container-org49d35ed" class="outline-3">
<h3 id="org49d35ed">Q150. What are the SQL isolation levels?</h3>
<div class="outline-text-3" id="text-org49d35ed">
<p>
From weakest to strongest: <code>READ UNCOMMITTED</code>, <code>READ COMMITTED</code>, <code>REPEATABLE READ</code>, <code>SERIALIZABLE</code>.
</p>
</div>
</div>
<div id="outline-container-org86857fb" class="outline-3">
<h3 id="org86857fb">Q151. What concurrency anomalies do isolation levels prevent?</h3>
<div class="outline-text-3" id="text-org86857fb">
<ul class="org-ul">
<li><b>Dirty read</b>: reading uncommitted data — prevented at READ COMMITTED+.</li>
<li><b>Non-repeatable read</b>: a row changes between reads — prevented at REPEATABLE READ+.</li>
<li><b>Phantom read</b>: new rows appear in a range between reads — prevented at SERIALIZABLE.</li>
</ul>
</div>
</div>
<div id="outline-container-orge0c0657" class="outline-3">
<h3 id="orge0c0657">Q152. What is the default isolation level?</h3>
<div class="outline-text-3" id="text-orge0c0657">
<p>
PostgreSQL/Oracle/SQL Server default to <code>READ COMMITTED</code>; MySQL (InnoDB) defaults to <code>REPEATABLE READ</code>.
</p>
</div>
</div>
<div id="outline-container-org5eb79d7" class="outline-3">
<h3 id="org5eb79d7">Q153. What is optimistic vs pessimistic locking?</h3>
<div class="outline-text-3" id="text-org5eb79d7">
<p>
<b>Pessimistic</b> locks rows up front (<code>SELECT ... FOR UPDATE</code>). <b>Optimistic</b> assumes
no conflict and checks a version/timestamp column at write time, retrying on mismatch.
</p>
</div>
</div>
<div id="outline-container-orgf768940" class="outline-3">
<h3 id="orgf768940">Q154. What is SELECT &#x2026; FOR UPDATE?</h3>
<div class="outline-text-3" id="text-orgf768940">
<p>
Locks the selected rows so other transactions can't modify them until the current
transaction ends — used to safely read-then-update.
</p>
</div>
</div>
<div id="outline-container-org0393d12" class="outline-3">
<h3 id="org0393d12">Q155. What is a deadlock?</h3>
<div class="outline-text-3" id="text-org0393d12">
<p>
Two transactions each hold a lock the other needs, blocking forever. The DB
detects it and aborts one (the "victim"). Mitigate by acquiring locks in a
consistent order and keeping transactions short.
</p>
</div>
</div>
<div id="outline-container-org884b2c5" class="outline-3">
<h3 id="org884b2c5">Q156. What is MVCC?</h3>
<div class="outline-text-3" id="text-org884b2c5">
<p>
Multi-Version Concurrency Control — readers see a consistent snapshot without
blocking writers (and vice versa) by keeping multiple row versions. Used by
PostgreSQL, Oracle, MySQL InnoDB.
</p>
</div>
</div>
<div id="outline-container-orgce9ac49" class="outline-3">
<h3 id="orgce9ac49">Q157. What is the difference between a shared and exclusive lock?</h3>
<div class="outline-text-3" id="text-orgce9ac49">
<p>
A <b>shared (read)</b> lock allows other shared locks but blocks writes. An <b>exclusive
(write)</b> lock blocks all other locks.
</p>
</div>
</div>
<div id="outline-container-orgda7b797" class="outline-3">
<h3 id="orgda7b797">Q158. What happens if you don't commit?</h3>
<div class="outline-text-3" id="text-orgda7b797">
<p>
Changes remain in the transaction's scope and are invisible to others; an open
transaction can hold locks and bloat undo/WAL. On disconnect, most engines roll
back uncommitted work.
</p>
</div>
</div>
<div id="outline-container-org81f1c1b" class="outline-3">
<h3 id="org81f1c1b">Q159. What is autocommit?</h3>
<div class="outline-text-3" id="text-org81f1c1b">
<p>
A mode where each statement is its own transaction, committed immediately. Most
clients enable it by default; disable it to batch statements into one transaction.
</p>
</div>
</div>
<div id="outline-container-orga519d57" class="outline-3">
<h3 id="orga519d57">Q160. How do you handle a serialization failure?</h3>
<div class="outline-text-3" id="text-orga519d57">
<p>
Under =SERIALIZABLE=/optimistic schemes, conflicting transactions get a
serialization error; the application should catch it and retry the transaction.
</p>
</div>
</div>
</div>
<div id="outline-container-org1eaab01" class="outline-2">
<h2 id="org1eaab01">Indexing &amp; Performance</h2>
<div class="outline-text-2" id="text-org1eaab01">
</div>
<div id="outline-container-org37f346f" class="outline-3">
<h3 id="org37f346f">Q161. What is an index?</h3>
<div class="outline-text-3" id="text-org37f346f">
<p>
A data structure (usually a B-tree) that speeds up row lookup at the cost of extra
storage and slower writes.
</p>
</div>
</div>
<div id="outline-container-org02209c3" class="outline-3">
<h3 id="org02209c3">Q162. What is the difference between a clustered and non-clustered index?</h3>
<div class="outline-text-3" id="text-org02209c3">
<p>
A <b>clustered</b> index determines the physical row order (the table <i>is</i> the index;
one per table). A <b>non-clustered</b> index is a separate structure pointing to rows.
(SQL Server terminology; PostgreSQL heap tables differ.)
</p>
</div>
</div>
<div id="outline-container-org8e8c904" class="outline-3">
<h3 id="org8e8c904">Q163. When does an index help vs. hurt?</h3>
<div class="outline-text-3" id="text-org8e8c904">
<p>
Helps selective lookups, joins, ORDER BY, and range scans. Hurts
INSERT/UPDATE/DELETE performance and consumes space. Over-indexing degrades writes.
</p>
</div>
</div>
<div id="outline-container-org6861216" class="outline-3">
<h3 id="org6861216">Q164. What is a composite index, and does column order matter?</h3>
<div class="outline-text-3" id="text-org6861216">
<p>
An index on multiple columns. Order matters: an index on <code>(a, b)</code> supports
filtering on <code>a</code> or <code>a, b</code> but not <code>b</code> alone (left-most prefix rule).
</p>
</div>
</div>
<div id="outline-container-orgcef94f7" class="outline-3">
<h3 id="orgcef94f7">Q165. What is a covering index?</h3>
<div class="outline-text-3" id="text-orgcef94f7">
<p>
An index that contains all columns a query needs, so the engine answers from the
index without touching the table ("index-only scan"). SQL Server uses <code>INCLUDE</code>
columns.
</p>
</div>
</div>
<div id="outline-container-org056a23f" class="outline-3">
<h3 id="org056a23f">Q166. Why might an index not be used?</h3>
<div class="outline-text-3" id="text-org056a23f">
<p>
Low selectivity, functions wrapping the column (<code>WHERE UPPER(name)=...</code>), implicit
type conversions, leading wildcard <code>LIKE '%x'</code>, stale statistics, or the optimizer
estimating a scan is cheaper.
</p>
</div>
</div>
<div id="outline-container-org18ad563" class="outline-3">
<h3 id="org18ad563">Q167. What is a query execution plan?</h3>
<div class="outline-text-3" id="text-org18ad563">
<p>
The optimizer's chosen strategy to run a query (scans, joins, order). View it with
<code>EXPLAIN=/=EXPLAIN ANALYZE</code> (PostgreSQL/MySQL) or <code>SET SHOWPLAN</code> execution plan (SQL Server).
</p>
</div>
</div>
<div id="outline-container-org826e97b" class="outline-3">
<h3 id="org826e97b">Q168. What's the difference between an index seek and an index scan?</h3>
<div class="outline-text-3" id="text-org826e97b">
<p>
A <b>seek</b> navigates directly to qualifying rows (efficient, selective).
A <b>scan</b> reads the whole index/table. Seeks are generally preferable for selective queries.
</p>
</div>
</div>
