org/posts/sql.org
** Q169. What is a partial/filtered index?
An index over a subset of rows defined by a predicate, smaller and faster for targeted queries:

#+begin_src sql
CREATE INDEX idx_active ON orders (created_at) WHERE status = 'active';
#+end_src

** Q170. What is a functional/expression index?
An index on an expression, enabling index use for that expression:

#+begin_src sql
CREATE INDEX idx_lower_email ON users (LOWER(email));
#+end_src

** Q171. How do statistics affect query performance?
The optimizer uses table/column statistics (row counts, value distribution) to
estimate costs. Stale stats lead to bad plans; refresh with =ANALYZE=/=UPDATE STATISTICS=.

** Q172. What are common causes of slow queries?
Missing indexes, =SELECT *=, non-sargable predicates, large unfiltered scans, N+1
query patterns, bad join order, parameter sniffing, lock contention, and
insufficient memory causing spills to disk.

** Q173. What is "sargable"?
Search ARGument ABLE — a predicate that can use an index (e.g., ~col = :v~ or ~col > :v~).
Wrapping the column in a function or doing arithmetic on it usually makes it non-sargable.

** Q174. How do you optimize pagination on large tables?
Use keyset (seek) pagination instead of large =OFFSET=:

#+begin_src sql
SELECT * FROM orders WHERE id > :last_seen_id ORDER BY id LIMIT 20;
#+end_src

** Q175. What is index fragmentation and how do you address it?
Over time, page splits and deletes leave indexes fragmented, hurting scans.
Rebuild or reorganize indexes (=REINDEX=, =ALTER INDEX ... REBUILD=) and tune fill factor.

* Advanced & Real-World
** Q176. What is an UPSERT and how do you do it?
Insert-or-update on conflict:

#+begin_src sql

-- PostgreSQL
INSERT INTO inventory (sku, qty) VALUES ('A1', 10)
ON CONFLICT (sku) DO UPDATE SET qty = inventory.qty + EXCLUDED.qty;

-- MySQL
INSERT INTO inventory (sku, qty) VALUES ('A1', 10)
ON DUPLICATE KEY UPDATE qty = qty + VALUES(qty);
#+end_src

** Q177. What is the MERGE statement?
A single statement to insert/update/delete a target based on a source — standard
SQL, supported by SQL Server/Oracle/PostgreSQL 15+:

#+begin_src sql
MERGE INTO target t USING source s ON t.id = s.id
WHEN MATCHED THEN UPDATE SET t.val = s.val
WHEN NOT MATCHED THEN INSERT (id, val) VALUES (s.id, s.val);
#+end_src

** Q178. How do you pivot rows into columns?
Conditional aggregation or =PIVOT= (SQL Server/Oracle):

#+begin_src sql
SELECT
  SUM(CASE WHEN quarter='Q1' THEN sales END) AS q1,
  SUM(CASE WHEN quarter='Q2' THEN sales END) AS q2
FROM revenue GROUP BY region;
#+end_src

** Q179. How do you unpivot columns into rows?
=UNPIVOT= (SQL Server/Oracle) or =UNION ALL= / =CROSS JOIN LATERAL (VALUES ...)= in PostgreSQL.

** Q180. What is a stored procedure?
A precompiled set of SQL statements stored in the database, callable by name,
supporting parameters and control flow — useful for encapsulating business logic
and reducing round-trips.

** Q181. What is the difference between a function and a stored procedure?
Functions return a value and can be used in queries (usually no side effects);
procedures perform actions (DML, transactions) and are invoked with =CALL=/=EXEC=,
often without returning a usable value in a SELECT.

** Q182. What is a trigger?
Code that automatically executes in response to =INSERT=/=UPDATE=/=DELETE= events
on a table — used for auditing, validation, or maintaining derived data. Use
sparingly; they hide logic and can hurt performance.

** Q183. How do you store and query JSON?
Modern engines have JSON types: PostgreSQL =jsonb=, MySQL =JSON=, SQL Server JSON functions.

#+begin_src sql
SELECT data->>'name' FROM events WHERE data->>'type' = 'click';  -- PostgreSQL
#+end_src

Index =jsonb= with GIN indexes for containment queries.

** Q184. How do you handle hierarchical data?
Options: adjacency list (=parent_id= + recursive CTE), nested sets, materialized path, or closure tables — each trades read vs. write complexity.

** Q185. What is a window frame "RANGE BETWEEN INTERVAL" used for?
Time-based windows, e.g., a 7-day rolling sum based on dates rather than row counts:

#+begin_src sql
SUM(amount) OVER (ORDER BY ts RANGE BETWEEN INTERVAL '7 days' PRECEDING AND CURRENT ROW)
#+end_src

