public/posts/sql.html
<div id="outline-container-orgfc3ee9b" class="outline-3">
<h3 id="orgfc3ee9b">Q169. What is a partial/filtered index?</h3>
<div class="outline-text-3" id="text-orgfc3ee9b">
<p>
An index over a subset of rows defined by a predicate, smaller and faster for targeted queries:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> INDEX idx_active <span style="font-weight: bold;">ON</span> orders (created_at) <span style="font-weight: bold;">WHERE</span> status = <span style="font-style: italic;">'active'</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab45259" class="outline-3">
<h3 id="orgab45259">Q170. What is a functional/expression index?</h3>
<div class="outline-text-3" id="text-orgab45259">
<p>
An index on an expression, enabling index use for that expression:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">CREATE</span> INDEX idx_lower_email <span style="font-weight: bold;">ON</span> users (<span style="font-weight: bold;">LOWER</span>(email));
</pre>
</div>
</div>
</div>
<div id="outline-container-org05b0ed4" class="outline-3">
<h3 id="org05b0ed4">Q171. How do statistics affect query performance?</h3>
<div class="outline-text-3" id="text-org05b0ed4">
<p>
The optimizer uses table/column statistics (row counts, value distribution) to
estimate costs. Stale stats lead to bad plans; refresh with <code>ANALYZE=/=UPDATE STATISTICS</code>.
</p>
</div>
</div>
<div id="outline-container-orgdb74207" class="outline-3">
<h3 id="orgdb74207">Q172. What are common causes of slow queries?</h3>
<div class="outline-text-3" id="text-orgdb74207">
<p>
Missing indexes, <code>SELECT *</code>, non-sargable predicates, large unfiltered scans, N+1
query patterns, bad join order, parameter sniffing, lock contention, and
insufficient memory causing spills to disk.
</p>
</div>
</div>
<div id="outline-container-orgf2b2498" class="outline-3">
<h3 id="orgf2b2498">Q173. What is "sargable"?</h3>
<div class="outline-text-3" id="text-orgf2b2498">
<p>
Search ARGument ABLE — a predicate that can use an index (e.g., <code>col = :v</code> or <code>col &gt; :v</code>).
Wrapping the column in a function or doing arithmetic on it usually makes it non-sargable.
</p>
</div>
</div>
<div id="outline-container-orgf4f9de4" class="outline-3">
<h3 id="orgf4f9de4">Q174. How do you optimize pagination on large tables?</h3>
<div class="outline-text-3" id="text-orgf4f9de4">
<p>
Use keyset (seek) pagination instead of large <code>OFFSET</code>:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> * <span style="font-weight: bold;">FROM</span> orders <span style="font-weight: bold;">WHERE</span> id &gt; :last_seen_id <span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> id <span style="font-weight: bold;">LIMIT</span> 20;
</pre>
</div>
</div>
</div>
<div id="outline-container-org9003cca" class="outline-3">
<h3 id="org9003cca">Q175. What is index fragmentation and how do you address it?</h3>
<div class="outline-text-3" id="text-org9003cca">
<p>
Over time, page splits and deletes leave indexes fragmented, hurting scans.
Rebuild or reorganize indexes (<code>REINDEX</code>, <code>ALTER INDEX ... REBUILD</code>) and tune fill factor.
</p>
</div>
</div>
</div>
<div id="outline-container-org0f9af2f" class="outline-2">
<h2 id="org0f9af2f">Advanced &amp; Real-World</h2>
<div class="outline-text-2" id="text-org0f9af2f">
</div>
<div id="outline-container-org07cc2c1" class="outline-3">
<h3 id="org07cc2c1">Q176. What is an UPSERT and how do you do it?</h3>
<div class="outline-text-3" id="text-org07cc2c1">
<p>
Insert-or-update on conflict:
</p>

<div class="org-src-container">
<pre class="src src-sql">
<span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">PostgreSQL
</span><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> inventory (sku, qty) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'A1'</span>, 10)
<span style="font-weight: bold;">ON</span> CONFLICT (sku) DO <span style="font-weight: bold;">UPDATE</span> <span style="font-weight: bold;">SET</span> qty = inventory.qty + EXCLUDED.qty;

<span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">MySQL
</span><span style="font-weight: bold;">INSERT</span> <span style="font-weight: bold;">INTO</span> inventory (sku, qty) <span style="font-weight: bold;">VALUES</span> (<span style="font-style: italic;">'A1'</span>, 10)
<span style="font-weight: bold;">ON</span> DUPLICATE <span style="font-weight: bold;">KEY</span> <span style="font-weight: bold;">UPDATE</span> qty = qty + <span style="font-weight: bold;">VALUES</span>(qty);
</pre>
</div>
</div>
</div>
<div id="outline-container-org31d56c6" class="outline-3">
<h3 id="org31d56c6">Q177. What is the MERGE statement?</h3>
<div class="outline-text-3" id="text-org31d56c6">
<p>
A single statement to insert/update/delete a target based on a source — standard
SQL, supported by SQL Server/Oracle/PostgreSQL 15+:
</p>

<div class="org-src-container">
<pre class="src src-sql">MERGE <span style="font-weight: bold;">INTO</span> target t <span style="font-weight: bold;">USING</span> <span style="font-weight: bold;">source</span> s <span style="font-weight: bold;">ON</span> t.id = s.id
<span style="font-weight: bold;">WHEN</span> MATCHED <span style="font-weight: bold;">THEN</span> <span style="font-weight: bold;">UPDATE</span> <span style="font-weight: bold;">SET</span> t.val = s.val
<span style="font-weight: bold;">WHEN</span> <span style="font-weight: bold;">NOT</span> MATCHED <span style="font-weight: bold;">THEN</span> <span style="font-weight: bold;">INSERT</span> (id, val) <span style="font-weight: bold;">VALUES</span> (s.id, s.val);
</pre>
</div>
</div>
</div>
<div id="outline-container-org25aa323" class="outline-3">
<h3 id="org25aa323">Q178. How do you pivot rows into columns?</h3>
<div class="outline-text-3" id="text-org25aa323">
<p>
Conditional aggregation or <code>PIVOT</code> (SQL Server/Oracle):
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span>
  <span style="font-weight: bold;">SUM</span>(<span style="font-weight: bold;">CASE</span> <span style="font-weight: bold;">WHEN</span> quarter=<span style="font-style: italic;">'Q1'</span> <span style="font-weight: bold;">THEN</span> sales <span style="font-weight: bold;">END</span>) <span style="font-weight: bold;">AS</span> q1,
  <span style="font-weight: bold;">SUM</span>(<span style="font-weight: bold;">CASE</span> <span style="font-weight: bold;">WHEN</span> quarter=<span style="font-style: italic;">'Q2'</span> <span style="font-weight: bold;">THEN</span> sales <span style="font-weight: bold;">END</span>) <span style="font-weight: bold;">AS</span> q2
<span style="font-weight: bold;">FROM</span> revenue <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> region;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaffc45f" class="outline-3">
<h3 id="orgaffc45f">Q179. How do you unpivot columns into rows?</h3>
<div class="outline-text-3" id="text-orgaffc45f">
<p>
<code>UNPIVOT</code> (SQL Server/Oracle) or <code>UNION ALL</code> / <code>CROSS JOIN LATERAL (VALUES ...)</code> in PostgreSQL.
</p>
</div>
</div>
<div id="outline-container-orgd4f5e65" class="outline-3">
<h3 id="orgd4f5e65">Q180. What is a stored procedure?</h3>
<div class="outline-text-3" id="text-orgd4f5e65">
<p>
A precompiled set of SQL statements stored in the database, callable by name,
supporting parameters and control flow — useful for encapsulating business logic
and reducing round-trips.
</p>
</div>
</div>
<div id="outline-container-org9c4b735" class="outline-3">
<h3 id="org9c4b735">Q181. What is the difference between a function and a stored procedure?</h3>
<div class="outline-text-3" id="text-org9c4b735">
<p>
Functions return a value and can be used in queries (usually no side effects);
procedures perform actions (DML, transactions) and are invoked with <code>CALL=/=EXEC</code>,
often without returning a usable value in a SELECT.
</p>
</div>
</div>
<div id="outline-container-org1d35365" class="outline-3">
<h3 id="org1d35365">Q182. What is a trigger?</h3>
<div class="outline-text-3" id="text-org1d35365">
<p>
Code that automatically executes in response to <code>INSERT=/=UPDATE=/=DELETE</code> events
on a table — used for auditing, validation, or maintaining derived data. Use
sparingly; they hide logic and can hurt performance.
</p>
</div>
</div>
<div id="outline-container-org2fb06d4" class="outline-3">
<h3 id="org2fb06d4">Q183. How do you store and query JSON?</h3>
<div class="outline-text-3" id="text-org2fb06d4">
<p>
Modern engines have JSON types: PostgreSQL <code>jsonb</code>, MySQL <code>JSON</code>, SQL Server JSON functions.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">data</span>-&gt;&gt;<span style="font-style: italic;">'name'</span> <span style="font-weight: bold;">FROM</span> events <span style="font-weight: bold;">WHERE</span> <span style="font-weight: bold;">data</span>-&gt;&gt;<span style="font-style: italic;">'type'</span> = <span style="font-style: italic;">'click'</span>;  <span style="font-weight: bold; font-style: italic;">-- </span><span style="font-weight: bold; font-style: italic;">PostgreSQL</span>
</pre>
</div>

<p>
Index <code>jsonb</code> with GIN indexes for containment queries.
</p>
</div>
</div>
<div id="outline-container-org40e2c36" class="outline-3">
<h3 id="org40e2c36">Q184. How do you handle hierarchical data?</h3>
<div class="outline-text-3" id="text-org40e2c36">
<p>
Options: adjacency list (<code>parent_id</code> + recursive CTE), nested sets, materialized path, or closure tables — each trades read vs. write complexity.
</p>
</div>
</div>
<div id="outline-container-orga121a0e" class="outline-3">
<h3 id="orga121a0e">Q185. What is a window frame "RANGE BETWEEN INTERVAL" used for?</h3>
<div class="outline-text-3" id="text-orga121a0e">
<p>
Time-based windows, e.g., a 7-day rolling sum based on dates rather than row counts:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SUM</span>(amount) OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> ts RANGE <span style="font-weight: bold;">BETWEEN</span> <span style="font-weight: bold; text-decoration: underline;">INTERVAL</span> <span style="font-style: italic;">'7 days'</span> PRECEDING <span style="font-weight: bold;">AND</span> <span style="font-weight: bold;">CURRENT</span> <span style="font-weight: bold; text-decoration: underline;">ROW</span>)
</pre>
</div>
</div>
</div>
