org/posts/sql.org
** Q186. How do you detect and remove gaps/islands in sequences?
The "gaps and islands" pattern uses =ROW_NUMBER()= differences to group
consecutive runs:

#+begin_src sql
SELECT MIN(d), MAX(d) FROM (
  SELECT d, d - (ROW_NUMBER() OVER (ORDER BY d)) * INTERVAL '1 day' AS grp
  FROM activity
) t GROUP BY grp;

#+end_src

 

** Q187. What is the difference between logical and physical data independence?
*Logical* independence: schema (logical) changes don't break applications (via
views). *Physical* independence: storage/index changes don't affect the logical
schema.

** Q188. How do you safely run a large UPDATE/DELETE?
Batch it (e.g., ~DELETE ... WHERE id IN (SELECT id ... LIMIT 10000)~ in a loop) to
limit lock duration and transaction log growth, commit between batches, and run
during low-traffic windows.

** Q189. What are common SQL anti-patterns?
=SELECT *=, implicit joins, N+1 queries, scalar functions in WHERE on indexed
columns, storing comma-separated lists instead of relations (EAV/jaywalking),
missing foreign keys, and overusing triggers/cursors.

** Q190. How do you prevent SQL injection?
Use parameterized queries / prepared statements — never concatenate user input
into SQL. Apply least-privilege DB accounts, validate input, and use ORMs/query
builders that parameterize by default.

-----

#+INCLUDE: "../footer.org"
