public/posts/sql.html
<div id="outline-container-orge844476" class="outline-3">
<h3 id="orge844476">Q186. How do you detect and remove gaps/islands in sequences?</h3>
<div class="outline-text-3" id="text-orge844476">
<p>
The "gaps and islands" pattern uses <code>ROW_NUMBER()</code> differences to group
consecutive runs:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="font-weight: bold;">SELECT</span> <span style="font-weight: bold;">MIN</span>(d), <span style="font-weight: bold;">MAX</span>(d) <span style="font-weight: bold;">FROM</span> (
  <span style="font-weight: bold;">SELECT</span> d, d - (ROW_NUMBER() OVER (<span style="font-weight: bold;">ORDER</span> <span style="font-weight: bold;">BY</span> d)) * <span style="font-weight: bold; text-decoration: underline;">INTERVAL</span> <span style="font-style: italic;">'1 day'</span> <span style="font-weight: bold;">AS</span> grp
  <span style="font-weight: bold;">FROM</span> activity
) t <span style="font-weight: bold;">GROUP</span> <span style="font-weight: bold;">BY</span> grp;

</pre>
</div>
</div>
</div>
<div id="outline-container-org559d845" class="outline-3">
<h3 id="org559d845">Q187. What is the difference between logical and physical data independence?</h3>
<div class="outline-text-3" id="text-org559d845">
<p>
<b>Logical</b> independence: schema (logical) changes don't break applications (via
views). <b>Physical</b> independence: storage/index changes don't affect the logical
schema.
</p>
</div>
</div>
<div id="outline-container-orgc4a916e" class="outline-3">
<h3 id="orgc4a916e">Q188. How do you safely run a large UPDATE/DELETE?</h3>
<div class="outline-text-3" id="text-orgc4a916e">
<p>
Batch it (e.g., <code>DELETE ... WHERE id IN (SELECT id ... LIMIT 10000)</code> in a loop) to
limit lock duration and transaction log growth, commit between batches, and run
during low-traffic windows.
</p>
</div>
</div>
<div id="outline-container-org83da609" class="outline-3">
<h3 id="org83da609">Q189. What are common SQL anti-patterns?</h3>
<div class="outline-text-3" id="text-org83da609">
<p>
<code>SELECT *</code>, implicit joins, N+1 queries, scalar functions in WHERE on indexed
columns, storing comma-separated lists instead of relations (EAV/jaywalking),
missing foreign keys, and overusing triggers/cursors.
</p>
</div>
</div>
<div id="outline-container-org18a5277" class="outline-3">
<h3 id="org18a5277">Q190. How do you prevent SQL injection?</h3>
<div class="outline-text-3" id="text-org18a5277">
<p>
Use parameterized queries / prepared statements — never concatenate user input
into SQL. Apply least-privilege DB accounts, validate input, and use ORMs/query
builders that parameterize by default.
</p>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
